[
    {
        "name": "CATH 111 Music in the Humanities",
        "description": "Historical survey of the development of music from antiquity to the present. Relationships between the other arts, philosophies, and social structures presented in context with the evolution of music. Emphasizes the understanding of music history through lecture, performance, and recordings.",
        "term": null
    },
    {
        "name": "CATH 117 Liturgical Music Ensemble",
        "description": "The Liturgical Music Ensemble consists of singers and instrumentalists who lead music at the university's festive liturgies, student Masses, ecumenical liturgies, and interfaith services. The course utilizes a diverse repertoire of sacred music, including new compositions, contemporary arrangements, repertoire from the Catholic tradition, hymns, anthems, Mass settings, gospel music, and repertoire from global cultures.",
        "term": null
    },
    {
        "name": "CATH 151 New Testament",
        "description": "An exploration of the world and environment of the New Testament writers as well as Christianity's roots in the Jewish tradition. A basic introduction to the writings of the New Testament. Offered every other semester.",
        "term": null
    },
    {
        "name": "CATH 152 Gospels: Life/Tch of Jesus",
        "description": "Who was Jesus? An academic study of Jesus as he is presented in the three synoptic gospels (Matthew, Mark, Luke) in the New Testament. Specific attention is given to the unique perspectives of each gospel, and to the ethical implications of Jesus’s life and teachings. Offered every year.",
        "term": null
    },
    {
        "name": "CATH 156 Intro to Christian Theology",
        "description": "An introduction to the academic discipline of Christian theology and the way in which the Christian community makes believing possible and meaningful for contemporary people of faith. Offered every semester.",
        "term": null
    },
    {
        "name": "CATH 190 Directed Study",
        "description": "Topic to be determined by faculty.",
        "term": null
    },
    {
        "name": "CATH 228 Catholicism",
        "description": "",
        "term": null
    },
    {
        "name": "CATH 240 Persons and Conduct",
        "description": "Two basic dimensions of philosophical investigation are inquiry into the nature and meaning of our being human (the philosophy of human nature) and inquiry into the right life and conduct of a human being (ethics). This course undertakes these closely related investigations from a personalist perspective.",
        "term": null
    },
    {
        "name": "CATH 250 Spirituality of Apostle Paul",
        "description": "Explore Paul's personal experience of faith in what he perceives as the cosmos altering significance of the life and death of Jesus of Nazareth on the one hand, and the practical implications of the Christ event for living transformed lives in the setting of communal fellowship, on the other. Offered every other semester.",
        "term": null
    },
    {
        "name": "CATH 255 Principles of Christian Ethics",
        "description": "How are Christians to fashion moral choices, character, and communities? What are the sources, tools, and rules of Christian ethics? What kind of justice does the Christian faith demand? Offered every semester.",
        "term": null
    },
    {
        "name": "CATH 256 Challenges in Catholic Theol",
        "description": "This course aims to explore the teachings and debates around several classical and perennial themes in Christian theology around which significant dialogue and debate exist today. Offered every year.",
        "term": null
    },
    {
        "name": "CATH 257 Theology in Global Contexts",
        "description": "A course in Christian and Catholic traditions with a Global Studies designation (GS), which investigates opportunities and challenges posed by religious and cultural diversity in our world today. Topics include Theologies of Religion, Culture, World Christianity, and Catholic Social Teaching. Offered most summers.",
        "term": null
    },
    {
        "name": "CATH 260 Contemporary Church",
        "description": "A theological and historical examination of the contemporary church from the perspective of the Second Vatican Council.",
        "term": null
    },
    {
        "name": "CATH 262 Global Christologies",
        "description": "Examine how Christian theological interpretations of the significance of the person of Jesus of Nazareth are shaped by the context in which church communities live. After examining Christological method, the biblical witness to Jesus, and early Christological doctrines, the course moves continent by continent to examine different contextual Christologies and the ways they call the Christian community to social transformation toward the reign of God. Offered every other semester.",
        "term": null
    },
    {
        "name": "CATH 263 Christian Spirituality",
        "description": "The sources, nature, and forms of Christian spirituality historically and within the contemporary context. Offered every semester.",
        "term": null
    },
    {
        "name": "CATH 265 Christian Mysticism",
        "description": "Explore the history, theology and practice of Christian mysticism from the early Church to the present day. Students are guided by the curriculum of the contemplative master, Thomas Merton, who situates the discipline of mysticism in the center of Christian life, and in relation to tradition, doctrine, worship, spiritual experience and ethical action. Offered every semester.",
        "term": null
    },
    {
        "name": "CATH 266 God and Evil",
        "description": "Explore the problem of God and the experience of evil from within the Christian theological tradition. Our exploration includes an examination of theological texts, poetry, film and the visual arts. Offered every other year.",
        "term": null
    },
    {
        "name": "CATH 269 Early Christianity",
        "description": "Focus on the rise of Christianity in the religious pluralism of late antiquity, and the way in which the early Christians, as citizens of a non-Christian culture, defined themselves, the church and their place in society. Examine the philosophical, social and religious context in the Roman empire, and central theological and institutional developments in the church from its origin to the fourth century. Offered every year.",
        "term": null
    },
    {
        "name": "CATH 290 Directed Study",
        "description": "Topic to be determined by faculty.",
        "term": null
    },
    {
        "name": "CATH 331 Medieval Europe",
        "description": "Developments in the first flowering of western Europe circa 500-1350, including feudalism, the rise of representative assemblies, the commercial revolution and the papal monarchy. Gonzaga in Florence only.",
        "term": null
    },
    {
        "name": "CATH 332 Renaissance Europe",
        "description": "A history of western Europe circa 1350-1550, examining the political, religious, social, and economic context for the cultural achievements of the humanists, artists, dramatists, scientists, architects, and educators of the age of Joan of Arc, Michelangelo, the Tudors, and the Medici.",
        "term": null
    },
    {
        "name": "CATH 333 Irish History Since 1500",
        "description": "This course has two purposes: to provide a broad overview of the major historical developments in Ireland from the seventeenth century to the twentieth century, and to introduce students to the historiographical debates that shape the study of modern Irish history. We will read about and discuss pivotal moments in Irish history during this time period, trying to understand what the primary agents of historical change in the country were, and what variable factors might have allowed the country’s history to follow a different path.",
        "term": null
    },
    {
        "name": "CATH 334 20th Century Northern Ireland",
        "description": "This course explores the troubled history of Northern Ireland from the perspective of the two communities that live within it, as well as that of the British and Irish governments. It examines key events in Northern Ireland’s recent history such as Bloody Sunday, internment, the murder of Lord Mountbatten, the hunger strikes, the Enniskillen and Omagh bombings, and the steps to the Peace Process. The course emphasizes how peace has been achieved in the wake of the \"Troubles\" as it examines whether the Good Friday Agreement can offer lessons to other conflict zones around the world.",
        "term": null
    },
    {
        "name": "CATH 335 American Latina/o History",
        "description": "An introduction to the history of American Latina/o communities from the nineteenth-century wars that brought northern Mexico, Cuba, and Puerto Rico under U.S. control; through the first major waves of immigration that brought Mexicans and other Latinas/os to the U.S.; through multiple generations of hardship, cultural transformation, and political mobilization; and finally to the issues and challenges of the early twenty-first century. Themes and topics include military conquest and resistance, immigration, discrimination and segregation, labor and migration, community formation, gender and sexuality, military service, religious faith and activism, civil rights activism, the farmworker movement, cultural nationalism, the evolution of diverse Latinx identities, and the overarching context of U.S. relations with Latin America.",
        "term": null
    },
    {
        "name": "CATH 340 History of Medieval Philosophy",
        "description": "A survey of the major philosophical movements in the Latin, Greek, and Arabic traditions from the seventh to the fourteenth centuries. Spring.",
        "term": "S"
    },
    {
        "name": "CATH 355 Trinity",
        "description": "An introduction to the theology of the Trinity in its historical developments and contemporary interpretations, this course examines the content and method of Christian theology by focusing on the doctrine of the Trinity. Offered every year.",
        "term": null
    },
    {
        "name": "CATH 356 Christian Morality and Eating",
        "description": "Why biblical and Christian morality demands just and sustainable agricultural systems that feed the hungry, compensate and protect workers, and treat animals humanely. Offered every year.",
        "term": null
    },
    {
        "name": "CATH 357 Christian Sexual Ethics",
        "description": "Explore Christian perspectives on the ethical dimensions of human sexuality and issues of gender. Offered every semester.",
        "term": null
    },
    {
        "name": "CATH 359 Ignatian Spirituality",
        "description": "This course is designed to introduce students of Christian and non-Christian backgrounds to Ignatian Spirituality. The major part of the course will study the dynamics of the Spiritual Exercises of Saint Ignatius by exploring the Ignatian themes of spiritual discernment, contemplation in action, and finding God in all things. Offered every semester.",
        "term": null
    },
    {
        "name": "CATH 390 Directed Study",
        "description": "Topic to be determined by faculty.",
        "term": null
    },
    {
        "name": "CATH 432 CIS:",
        "description": "The Core Integration Seminar (CIS) engages the Year Four Question: “Imagining the possible: What is our role in the world?” by offering students a culminating seminar experience in which students integrate the principles of Jesuit education, prior components of the Core, and their disciplinary expertise. Each section of the course will focus on a problem or issue raised by the contemporary world that encourages integration, collaboration, and problem solving. The topic for each section of the course will be proposed and developed by each faculty member in a way that clearly connects to the Jesuit Mission, to multiple disciplinary perspectives, and to our students’ future role in the world.",
        "term": null
    },
    {
        "name": "CATH 441 Christian Metaphysics",
        "description": "A philosophical articulation of the Christian worldview is provided by classical metaphysics as developed in the Thomistic tradition. This seminar will study the hylomorphic principles of nature, the cosmological argument for the existence of God, the real distinction of being and essence, the nature of divine causality, the analogy of being, ontological participation, and the transcendental properties of being. Fall, every year.",
        "term": "F"
    },
    {
        "name": "CATH 443 Dorothy Day&the Cath Wkr Mvmt",
        "description": "This course investigates the life, times, and leading ideas of Dorothy Day and the Catholic Worker Movement in a variety of disciplinary contexts, including history, philosophy, and religious, women's, and social justice studies.",
        "term": null,
        "prerequisites": {
            "type": "or",
            "requirements": [
                {
                    "course": "PHIL 201 Minimum Grade: D"
                },
                {
                    "course": "PHIL 201H Minimum Grade: D"
                }
            ]
        }
    },
    {
        "name": "CATH 447 Faith and Reason",
        "description": "This course will address a cluster of fundamental problems of faith and reason--the nature of knowledge, especially in connection with religious claims, evidence for the existence of God, the relevance of recent advances in cosmology to the Christian world view, the problem of evil and suffering, and the challenge of atheism.",
        "term": null
    },
    {
        "name": "CATH 489 Catholic Studies Symposium",
        "description": "A capstone course in which students will integrate their experiences in other Catholic Studies courses. Student will be responsible for writing a thesis under the direction of the instructor.",
        "term": null
    },
    {
        "name": "CATH 490 Directed Study",
        "description": "Topic to be determined by faculty.",
        "term": null
    }
]