[
    {
        "name": "CLAS 110 Intro to the Ancient World",
        "description": "An introductory survey to the origins of Western civilization in the Mediterranean world, with particular focus on the Classical cultures of Greece and Rome. The course will focus upon an exploration of these ancient societies, their origins and structure, their social and political constructs, and their neighbors and worldviews. Particular emphasis will be placed upon examining the enduring legacies produced by these ancient peoples and their continuing influence upon the concepts and ideals valued by our contemporary Western culture.",
        "term": null
    },
    {
        "name": "CLAS 193 FYS:",
        "description": "The First-Year Seminar (FYS) introduces new Gonzaga students to the University, the Core Curriculum, and Gonzaga’s Jesuit mission and heritage. While the seminars will be taught by faculty with expertise in particular disciplines, topics will be addressed in a way that illustrates approaches and methods of different academic disciplines. The seminar format of the course highlights the participatory character of university life, emphasizing that learning is an active, collegial process.",
        "term": null
    },
    {
        "name": "CLAS 220 Intro to Classical Literature",
        "description": "This course is a survey of the literature of the ancient Greeks and Romans. It introduces students to the important authors of Classical Antiquity, the critical issues surrounding their work, and their lasting influence. It stresses the role that ancient authors had in shaping our understanding of literature: its genres, methods, and subject matter. Spring.",
        "term": "S"
    },
    {
        "name": "CLAS 310 Greek Gods & Heroes",
        "description": "A study of Greek Mythology that uses texts (in translation), architecture and archaeology to explore the most important characters and stories of Greek mythology that have become part of the art, literature and imagination of western civilization. This course gives students insight into approaches toward the understanding of myth, especially classical myth that are helpful for their own studies and interests. Fall, alternate years.",
        "term": "F"
    },
    {
        "name": "CLAS 320 The Iliad & the Odyssey",
        "description": "FallFalkThis course explores (in translation) Homer's Iliad and Odyssey, two poems that are among the foundations of the literature of western civilization. Students will demonstrate an ability to read and analyze these two great epics of ancient Greece in a way that appreciates and unlocks their timeless beauty, depth and significance especially in a way that is helpful for their own studies and interests. Fall, alternate years.",
        "term": "F"
    },
    {
        "name": "CLAS 325 Topics in Language",
        "description": "",
        "term": null
    },
    {
        "name": "CLAS 330 Women in Antiquity",
        "description": "An examination of the representation of women Greece and Rome through image and text, using a variety of literary, art historical, and archaeological sources. This course is intended both to illuminate the lives of women in Classical Antiquity and to demonstrate how this illumination is important for a full understanding of the societies of Greece (in particular, Athens) and Rome. Students also gain valuable experience in thinking critically about sources, both ancient and modern. Spring, alternate years.",
        "term": "S"
    },
    {
        "name": "CLAS 335 Greek Tragedy",
        "description": "This course will combine performance text analysis with a detailed study of ancient Greek theater and its conventions. In this course, we will read a range of ancient Greek plays (primarily, but not exclusively, tragedies) as well as some more modern adaptations of Greek texts. In addition to readings scripts of ancient and modern plays, we will also read texts that provide access to the creative process and invite us to consider different modes of creative generation.",
        "term": null
    },
    {
        "name": "CLAS 340 Roman Epic",
        "description": "This course explores (in translation) two of Rome's great contributions to world literature: Vergil's Aeneid and Lucan's Civil War. These works are at the core of the western tradition. They have been read and reinterpreted for millennia and continue to find resonance today. Students learn to read and analyze these poems closely, to appreciate them, and to unlock their timeless beauty, depth and significance. Special attention is paid to applying the themes of these works to students' own lives and studies.",
        "term": null
    },
    {
        "name": "CLAS 350 Love Poetry in Antiquity",
        "description": "Is love a modern invention? This course looks at the phenomenon of love as it appears in the poetry of the ancient Greeks and Romans. Works read (in translation) will include those of Sappho, Callimachus, Catullus Ovid and others. Students will investigate ancient attitudes towards love, sex, and gender roles while developing an appreciation for the differences between time periods, authors, style, and genre. Students will also explore the long-lasting influence of this poetry and find ways to apply it to their own studies and interests.",
        "term": null
    },
    {
        "name": "CLAS 360 Ancient N. Eastern Archaeology",
        "description": "Ancient Near Eastern Archaeology will introduce the student to the archaeology of Mesopotamia, Egypt and the Levant. Archaeological methodology, the history of excavation of ancient sites and material culture will be examined as well as ancient languages, literature and history.",
        "term": null
    },
    {
        "name": "CLAS 370 Peoples and Empires of Turkey",
        "description": "This course will provide students with a comprehensive survey of major historical and cultural developments associated with ancient civilizations in Turkey. Using primary textual and archaeological sources, course content will focus upon investigating key trends and cultural movements originating in early societies and ancient empires, from the advent of our earliest known human settlements to the impact of the imperial domination within the Mediterranean basin. Offered as Study Abroad/Summer Course only.",
        "term": null
    },
    {
        "name": "CLAS 375 Topics in Classic Civilization",
        "description": "A course offering the student an opportunity to study literature of the Classical world in translation.",
        "term": null
    },
    {
        "name": "CLAS 410 Topics in Greek Civilization",
        "description": "A course offering the student an opportunity to study aspects of classical civilization, with a specialized focus on aspects of the Greek world and its culture.",
        "term": null
    },
    {
        "name": "CLAS 420 Topics in Roman Civilization",
        "description": "A course offering the student an opportunity to study aspects of classical civilization, with a specialized focus on aspects of the Roman world and its culture.",
        "term": null
    },
    {
        "name": "CLAS 432 CIS:",
        "description": "The Core Integration Seminar (CIS) engages the Year Four Question: “Imagining the possible: What is our role in the world?” by offering students a culminating seminar experience in which students integrate the principles of Jesuit education, prior components of the Core, and their disciplinary expertise. Each section of the course will focus on a problem or issue raised by the contemporary world that encourages integration, collaboration, and problem solving. The topic for each section of the course will be proposed and developed by each faculty member in a way that clearly connects to the Jesuit Mission, to multiple disciplinary perspectives, and to our students’ future role in the world. Spring.",
        "term": "S"
    },
    {
        "name": "CLAS 490 Directed Study",
        "description": "Directed Study requires completion of a form and Dept. permission, and cannot be registered for via Zagweb.",
        "term": null
    },
    {
        "name": "CLAS 491 Independent Study",
        "description": "Course content to be determined by the instructor.",
        "term": null
    },
    {
        "name": "CLAS 497 Internship",
        "description": "Professional work experience related to classical civilizations.",
        "term": null
    },
    {
        "name": "CLAS 499 Senior Thesis",
        "description": "The senior thesis is required for majors in Classical Civilizations in their fourth year. Fall.",
        "term": "F"
    },
    {
        "name": "GREK 101 Greek I",
        "description": "A beginner's course in Attic Greek: grammar, composition, and easy prose selections. Fall.",
        "term": "F"
    },
    {
        "name": "GREK 102 Greek II",
        "description": "Continuation of GREK 101 and more advanced grammar, composition and readings. Spring.",
        "term": "S",
        "prerequisites": {
            "course": "GREK 101 Minimum Grade: D"
        }
    },
    {
        "name": "GREK 103 Accelerated Elementary Greek",
        "description": "This is an entry-level course, with no prerequisite, designed to provide the equivalent of the first-year Greek (Attic) sequence GREK 101-102. It therefore prepares students for GREK 201. Students will learn the fundamentals of Greek vocabulary, grammar, and syntax in order to develop the skills necessary for basic translation and composition of Greek texts. Summer only.",
        "term": null
    },
    {
        "name": "GREK 151 Biblical Greek I",
        "description": "A beginner's course in New Testament Greek: grammar, composition, and easy prose selections.",
        "term": null
    },
    {
        "name": "GREK 152 Biblical Greek II",
        "description": "Continuation of GREK 151 and more advanced grammar, composition and readings.",
        "term": null,
        "prerequisites": {
            "course": "GREK 151 Minimum Grade: D"
        }
    },
    {
        "name": "GREK 190 Directed Study",
        "description": "",
        "term": null
    },
    {
        "name": "GREK 201 Greek III",
        "description": "Continuation of GREK 102: review of forms, syntax, readings. Fall.",
        "term": "F",
        "prerequisites": {
            "type": "or",
            "requirements": [
                {
                    "course": "GREK 102 Minimum Grade: D"
                },
                {
                    "course": "GREK 103 Minimum Grade: D"
                }
            ]
        }
    },
    {
        "name": "GREK 210 Reading Attic Greek",
        "description": "This course develops the skill of reading unabridged, original Geek texts. The introductory sequence (GREK 101,102, 201) is prerequisite. Students are expected to be familiar with the fundamentals of Greek grammar, syntax, and vocabulary, and to have some experience translating. Students will learn how to integrate and synthesize those fundamentals in order to fluidly and fluently engage with extended unabridged texts in the original Greek. Spring.",
        "term": "S",
        "prerequisites": {
            "course": "GREK 201 Minimum Grade: D"
        }
    },
    {
        "name": "GREK 251 Biblical Greek III",
        "description": "Continuation of GREK 152: review of forms, syntax and readings.",
        "term": null,
        "prerequisites": {
            "course": "GREK 152 Minimum Grade: D"
        }
    },
    {
        "name": "GREK 260 Reading New Testament Greek",
        "description": "This course develops the skill of reading the Greek New Testament in its unabridged original form. The introductory sequence (GREK 151, 152, 251) is prerequisite. Students are expected to be familiar with the fundamentals of Koine Greek grammar, syntax, and vocabulary, and to have some experience translating. Students will learn how to integrate and synthesize those fundamentals in order to fluidly and fluently engage with extended unabridged texts in the original Greek",
        "term": null,
        "prerequisites": {
            "course": "GREK 251 Minimum Grade: D"
        }
    },
    {
        "name": "GREK 290 Directed Study",
        "description": "Topic to be determined by the instructor.",
        "term": null
    },
    {
        "name": "GREK 291 Independent Study",
        "description": "Topics to be determined by instructor.",
        "term": null
    },
    {
        "name": "GREK 390 Directed Study",
        "description": "Topic to be determined by the instructor.",
        "term": null
    },
    {
        "name": "GREK 490 Directed Study",
        "description": "Directed study requires completion of an Individualized Study form and department permission. This course cannot be registered for via Zagweb.",
        "term": null,
        "prerequisites": {
            "course": "GREK 210 Minimum Grade: D"
        }
    },
    {
        "name": "GREK 491 Independent Reading Course",
        "description": "Course content to be determined by the instructor.",
        "term": null
    },
    {
        "name": "LATN 101 Latin I",
        "description": "A beginner's course: grammar, composition, and easy prose selections. Fall.",
        "term": "F"
    },
    {
        "name": "LATN 102 Latin II",
        "description": "Continuation of LATN 101 and more advanced grammar, composition and readings. Spring.",
        "term": "S",
        "prerequisites": {
            "course": "LATN 101 Minimum Grade: D"
        }
    },
    {
        "name": "LATN 103 Accelerated Elementary Latin",
        "description": "This is an entry-level 12-week course, with no prerequisite, designed to provide the equivalent of the first-year Latin sequence LATN 101-102. It therefore prepares students for either LATN 201 or LATN 104. The course will cover approximately the first half of Wheelock's Latin. Students will learn the fundamentals of Latin vocabulary, grammar, and syntax in order to develop the skills necessary for basic translation and composition of Latin texts. Summer only.",
        "term": null
    },
    {
        "name": "LATN 190 Directed Study",
        "description": "Topic to be determined by instructor.",
        "term": null
    },
    {
        "name": "LATN 201 Latin III",
        "description": "Continuation of LATN 101 and 102: review of forms and syntax; composition, and readings.  Fall.",
        "term": "F",
        "prerequisites": {
            "type": "or",
            "requirements": [
                {
                    "course": "LATN 102 Minimum Grade: D"
                },
                {
                    "course": "LATN 103 Minimum Grade: D"
                }
            ]
        }
    },
    {
        "name": "LATN 203 Accelerated Latin III",
        "description": "This 12-week course is designed to provide the equivalent of the second-year Latin sequence LATN 201-202 and therefore prepare students for LATN 301. The course will cover approximately the second half of Wheelock's Latin. Students will learn advanced Latin vocabulary, grammar, and syntax in order to master the skills necessary for translation and composition of Latin texts. Summer only.",
        "term": null,
        "prerequisites": {
            "type": "or",
            "requirements": [
                {
                    "course": "LATN 103 Minimum Grade: D"
                },
                {
                    "course": "LATN 102 Minimum Grade: D"
                }
            ]
        }
    },
    {
        "name": "LATN 210 Reading Latin",
        "description": "Continuation of LATN 201.  Spring.",
        "term": "S",
        "prerequisites": {
            "course": "LATN 201 Minimum Grade: D"
        }
    },
    {
        "name": "LATN 290 Directed Study",
        "description": "Course content to be determined by the instructor.",
        "term": null
    },
    {
        "name": "LATN 301 Republican Latin Prose",
        "description": "Courses or tutorials for students who have completed the intermediate level Latin and are reading original Latin authors. Fall, alternate years.",
        "term": "F",
        "prerequisites": {
            "type": "or",
            "requirements": [
                {
                    "course": "LATN 203 Minimum Grade: C"
                },
                {
                    "course": "LATN 201 Minimum Grade: C"
                }
            ]
        }
    },
    {
        "name": "LATN 302 Imperial Latin Prose",
        "description": "Courses or tutorials for students who have completed the intermediate level Latin and are reading original Latin authors. Fall, alternate years.",
        "term": "F",
        "prerequisites": {
            "type": "or",
            "requirements": [
                {
                    "course": "LATN 201 Minimum Grade: C"
                },
                {
                    "course": "LATN 203 Minimum Grade: C"
                }
            ]
        }
    },
    {
        "name": "LATN 303 Republican Latin Poetry",
        "description": "Courses or tutorials for students who have completed the intermediate level Latin and are reading original Latin authors. Spring, alternate years.",
        "term": "S",
        "prerequisites": {
            "type": "or",
            "requirements": [
                {
                    "course": "LATN 201 Minimum Grade: C"
                },
                {
                    "course": "LATN 203 Minimum Grade: C"
                }
            ]
        }
    },
    {
        "name": "LATN 304 Imperial Latin Poetry",
        "description": "Courses or tutorials for students who have completed the intermediate level Latin and are reading original Latin authors. Spring, alternate years.",
        "term": "S",
        "prerequisites": {
            "type": "or",
            "requirements": [
                {
                    "course": "LATN 201 Minimum Grade: C"
                },
                {
                    "course": "LATN 203 Minimum Grade: C"
                }
            ]
        }
    },
    {
        "name": "LATN 305 Vergil",
        "description": "This course explores the works of the greatest of the Latin writers, the Roman poet Publius Vergilius Maro, commonly called Vergil (or Virgil). Students will read selections from all three of Vergil's canonical works, the Eclogues, Georgics, and Aeneid, and will learn about the poet's development, achievement, and influence. The course is designed for students who have completed intermediate level Latin and are able to read original Latin texts.",
        "term": null,
        "prerequisites": {
            "type": "or",
            "requirements": [
                {
                    "course": "LATN 201 Minimum Grade: D"
                },
                {
                    "course": "LATN 203 Minimum Grade: D"
                }
            ]
        }
    },
    {
        "name": "LATN 310 Medieval Latin",
        "description": "Courses or tutorials for students who have completed the intermediate level Latin and are reading original Latin authors.",
        "term": null,
        "prerequisites": {
            "course": "LATN 201 Minimum Grade: D"
        }
    },
    {
        "name": "LATN 490 Directed Study",
        "description": "Directed Study requires completion of a form and Department permission, and cannot be registered for via Zagweb.",
        "term": null
    },
    {
        "name": "LATN 491 Independent Reading Course",
        "description": "",
        "term": null
    }
]