[
    {
        "name": "DANC 100 Introduction to Dance",
        "description": "This course introduces dance as an art form composed for the stage and as a social form present in all cultures. Students will gain the necessary skills and understanding for an appreciation of the social, physical, and artistic qualities of dance through various forms and cultures.",
        "term": null
    },
    {
        "name": "DANC 105 Jazz Dance I",
        "description": "Beginning and continuing instruction in jazz dance. This course includes the technique, vocabulary and history of the genre. Fall.",
        "term": "F"
    },
    {
        "name": "DANC 110 Contemporary/Modern Dance I",
        "description": "In this course, students learn the vocabulary, history, elementary principles and techniques of Contemporary and Modern Dance. Students also develop an understanding and appreciation of dance as a disciplined art form and integral part of the performing arts. This is a beginning level course. Fall.",
        "term": "F"
    },
    {
        "name": "DANC 115 Ballet I",
        "description": "In this course, students learn the vocabulary, history, elementary principles and techniques of Ballet. Students also develop an understanding and appreciation of Ballet as a disciplined art form and integral part of the performing arts. This is a beginning level course.",
        "term": null
    },
    {
        "name": "DANC 155 Dance: Culture and Art",
        "description": "This course provides the necessary skills and understanding for an appreciation of the social, physical, and artistic qualities of dance through various cultures. Physical learning of a number of social/ballroom dance forms is paired with cognitive and emotional understanding of the countries and cultures from which they were derived. Students study the concepts of lead/follow, the transition from social to concert dance as a global phenomenon and gain an understanding of dance from a global perspective.",
        "term": null
    },
    {
        "name": "DANC 165 Interdisciplinary Arts",
        "description": "This course uses concepts of theatre-, dance-, and visual arts-based research to solve problems. Students will be exposed, through lecture and assignments, to theories and methods from each art form and will learn to integrate the art forms to explore complex concepts through performance.",
        "term": null
    },
    {
        "name": "DANC 170 Princ of Dance Conditioning",
        "description": "This course introduces the foundations of human movement and Functional Awareness Principles. This course is designed to encourage optimal use of the dancer’s body through exploration of proper alignment techniques, somatic practices and human anatomy and physiology. Increased knowledge of human movement empowers students to prevent injury and enhance longevity and performance. Students are challenged to explore course content through lectures, classroom discussion, and practical dance training exercises.",
        "term": null
    },
    {
        "name": "DANC 180 Topics in Dance",
        "description": "",
        "term": null
    },
    {
        "name": "DANC 190 Independent Study",
        "description": "Topic to be determined by instructor.",
        "term": null
    },
    {
        "name": "DANC 193 FYS:",
        "description": "The First-Year Seminar (FYS) introduces new Gonzaga students to the University, the Core Curriculum, and Gonzaga’s Jesuit mission and heritage. While the seminars will be taught by faculty with expertise in particular disciplines, topics will be addressed in a way that illustrates approaches and methods of different academic disciplines. The seminar format of the course highlights the participatory character of university life, emphasizing that learning is an active, collegial process.",
        "term": null
    },
    {
        "name": "DANC 205 Jazz Dance II",
        "description": "This intermediate course in jazz dance focuses on technique, vocabulary, choreography and performance studies.",
        "term": null
    },
    {
        "name": "DANC 210 Contemporary/Modern Dance II",
        "description": "In this intermediate course, students continue to learn the vocabulary, principles, and techniques of Contemporary Modern Dance. Students also develop an understanding and appreciate of dance as a disciplined art form and integral part of the performing arts.",
        "term": null
    },
    {
        "name": "DANC 215 Ballet II",
        "description": "This intermediate course in Ballet builds upon the elementary principles and techniques of Ballet I, focuses on technique, an expanded dance vocabulary, and a survey of ballet styles and methodology.",
        "term": null
    },
    {
        "name": "DANC 270 Dance History",
        "description": "This course introduces students to major concepts and approaches in the study of dance as a political, historical, and artistic practice. Students will look at dance as a reflection of culture and as an art form from earliest societies to the present, focusing on western dance history and its multi-cultural influences.",
        "term": null
    },
    {
        "name": "DANC 280 Special Topics",
        "description": "Topic to be determined by instructor.",
        "term": null
    },
    {
        "name": "DANC 285 Interdiscipl Arts E-portfolio",
        "description": "In this zero credit course taken each fall of sophomore and junior years, Interdisciplinary Arts Minor students will submit work from the year before into an e-portfolio format. This will be reviewed by the Director and the student in a scheduled meeting, reviewing ideas for the senior synthesis project and ensuring they are on track with coursework.",
        "term": null
    },
    {
        "name": "DANC 290 Independent Study",
        "description": "Topic to be determined by instructor.",
        "term": null
    },
    {
        "name": "DANC 300 Musical Theatre Dance",
        "description": "In this course, students learn Musical Theatre Dance and History. By examining the unique aspects of multiple styles of dance and physically learning numbers from musical theatre, students prepare for the Spring Dance Concert. This course is a performance-focused study of Dance, but also includes research and presentations in Musical Theatre Dance history.",
        "term": "S"
    },
    {
        "name": "DANC 301 Pop Culture Dance",
        "description": "This course is an examination of the history and the physical styles of hip hop, fusion, funk, contemporary, and other pop culture genres of dance. This experiential dance class includes a public performance in the Spring Dance Concert. First level class recommended. Spring, odd years.",
        "term": "SO"
    },
    {
        "name": "DANC 305 Jazz Dance III",
        "description": "Advanced course in Jazz focuses on technique and individual artistry and includes a survey of relevant dance works, companies, and careers in dance. When taken in conjunction with DANC 405 students perform in the Spring Dance Concert.",
        "term": "S"
    },
    {
        "name": "DANC 310 Contemp/Modern III",
        "description": "Advanced course in Contemporary Modern Dance focuses on technique and individual artistry and includes a survey of relevant dance works, companies, and careers in dance. When taken in conjunction with DANC 410 students perform in the Spring Dance Concert.",
        "term": "S"
    },
    {
        "name": "DANC 315 Ballet III",
        "description": "Advanced course in Ballet focuses on technique and individual artistry and includes a survey of relevant dance works, ballet companies, and careers in dance. In addition, this course provides students with an opportunity to continue their study of classical ballet technique with an emphasis on technical and artistic development through their participation in the Spring Dance Concert.",
        "term": "S"
    },
    {
        "name": "DANC 360 Dance Company Lab",
        "description": "Participation as a performer in a Dance Program company or ensemble. Spring and Fall. Course repeatable for 6 credits",
        "term": "S"
    },
    {
        "name": "DANC 380 Topics in Dance",
        "description": "Topic to be determined by instructor.",
        "term": null
    },
    {
        "name": "DANC 390 Independent Study",
        "description": "",
        "term": null
    },
    {
        "name": "DANC 405 Jazz Dance Performance",
        "description": "Advanced course in Jazz Dance focuses on the application of technique, individual artistry and choreography in performance. Dancers participate in public performances of the Spring Dance Concert. Spring.",
        "term": "S"
    },
    {
        "name": "DANC 410 Contemp/Modern Performance",
        "description": "Advanced course in Contemporary and Modern Dance focuses on the application of technique, individual artistry and choreography in performance. Dancers participate in public performances of the Spring Dance Concert. Spring.",
        "term": "S"
    },
    {
        "name": "DANC 415 Ballet Performance",
        "description": "This advanced course in Ballet has a co-requisite of DANC 315 Ballet III, which focuses on technique and individual artistry and includes a survey of relevant dance works, ballet companies, and careers in dance. In addition, this course provides students with an opportunity to continue their study of classical ballet technique with an emphasis on technical and artistic development through their participation in the Spring Dance Concert.",
        "term": "S"
    },
    {
        "name": "DANC 455 Dance Senior Seminar",
        "description": "A career preparation and individual artistic development experience in a cohort and mentorship setting. Students engage in self-initiated as well as guided exercises to prepare for life and career after graduation. Fall.",
        "term": "F"
    },
    {
        "name": "DANC 460 Advanced Dance Production",
        "description": "Students learn the specifics of how to produce dance concerts. The learning experience includes advanced participation in producing fall dance concerts including but not limited to marketing, production meeting, theatre preparation, lighting, sound, house management etc.",
        "term": null
    },
    {
        "name": "DANC 465 Choreography",
        "description": "This course is about finding one’s ‘voice’ through the study and application of the art of dance composition. Choreography in dance history, contemporary methods, dynamics, rhythm, design, motivation, gesture and improvisation are explored as basic elements for building dance. The final\nproject will be presenting a work in the Gonzaga Student Choreography Concert. Students will leave this course able to express their creative ideas through the artistic medium of dance. It is strongly recommended that students participate in the Student Choreography Concert as a dancer prior to taking this course.",
        "term": null
    },
    {
        "name": "DANC 466 Advanced Composition",
        "description": "This course builds on the coursework from THEA 425. With a foundation in dance conceptualization, analysis, communication, and choreography, students create advanced compositions by further developing their voice as a dance artist. Students in this course have the opportunity to observe, reflect and revise and further develop their individual creative voice.",
        "term": null
    },
    {
        "name": "DANC 467 Dance Choreography Lab",
        "description": "Participation as a choreographer (working closely with faculty advisor(s)) in a Department dance company/ensemble or Theatrical production. Spring and Fall.",
        "term": "S",
        "prerequisites": {
            "course": "DANC 465 Minimum Grade: D"
        }
    },
    {
        "name": "DANC 470 Strategies: Dance Instruction",
        "description": "In this course, students learn a variety of dance teaching styles, strategies, curriculum planning, and evaluation methods. Students will develop their own teaching style through a service-learning practicum leading an after-school creative dance program (ZagDance). Students will examine how economic factors including access, transportation and support can hinder the children’s previous exposure to dance class. Emphasis is placed on teaching basic creative dance to build a positive classroom environment while meeting the needs of various levels of elementary dance students.",
        "term": null
    },
    {
        "name": "DANC 471 Dance Pedagogy for the Studio",
        "description": "Students will continue to explore a variety of pedagogical styles and strategies, curriculum planning and evaluation methods in the field of dance.",
        "term": null,
        "prerequisites": {
            "course": "DANC 470 Minimum Grade: D"
        }
    },
    {
        "name": "DANC 497 Internship",
        "description": "Topic and work load to be determined by student and instructor.",
        "term": null
    }
]