[
    {
        "name": "HIST 101 Foundations of the West",
        "description": "A survey of the West's origins in the Near East, the classical Mediterranean, the foundations of monotheism, and developments to the early modern era.",
        "term": null
    },
    {
        "name": "HIST 102 The West and the World",
        "description": "A survey of the early modern and modern West with emphasis on ideas, politics, and social changes.",
        "term": null
    },
    {
        "name": "HIST 103 United States History I",
        "description": "This course surveys North American history from the continent’s first peopling through the end of the U.S. Civil War. It pays special attention to: the relationships between Indigenous and European nations; the creation and growth of the United States; the interconnectedness between American slavery and American freedom; the defining structures of genders, races, ethnicities, and classes. It covers some of the major social, cultural, political, economic, intellectual, religious and environmental forces that shaped the early North American continent and the young United States.",
        "term": null
    },
    {
        "name": "HIST 104 United States History II",
        "description": "This course surveys U.S. History since the end of the Civil War with an emphasis on broad economic, political, social, and cultural changes. The course explores transformative events, ideas, and developments, including: Reconstruction and racial segregation; industrialization, immigration, and urbanization; progressive reforms and reactionary politics; WWI and WWII; the Great Depression; the Cold War, anti-communism, and suburbanization; the Vietnam War; civil rights movements; and the changing role of the U.S. in global affairs. The course addresses the perspectives, struggles, and successes of the many communities that have shaped America's diverse society and culture.",
        "term": null
    },
    {
        "name": "HIST 105 Russia: Nation, State, Empire",
        "description": "This course is a broad survey of Russian history. Students will become familiar with the features of Russian culture and the forms that Russian statehood has taken from the middle-ages through the imperial and Soviet eras.",
        "term": null
    },
    {
        "name": "HIST 106 Asian&PacificIslanderAmerHist",
        "description": "Examines U.S. history by centering Pacific Islander/Americans and Asian Americans. Provides an introduction to immigration, community-formation, colonization, racialization, labor, legal restrictions, activism, and justice movements.",
        "term": null
    },
    {
        "name": "HIST 107 The Ancient World",
        "description": "This course is a survey of the ancient world, from the rise of early human cultures and the development of early human society to the creation of complex civilizations such as Greece and Rome.",
        "term": null
    },
    {
        "name": "HIST 108 Intro to Pacific NW History",
        "description": "An introduction to the social, economic, political, and cultural development of the Pacific Northwest since the late eighteenth century. The primary geographical focus is on Washington, Oregon, and Idaho. The course explores three overarching themes: the region’s social and cultural diversity, competition over the region’s natural resources, and the development of regional identity.",
        "term": null
    },
    {
        "name": "HIST 109 History of Islamic Societies",
        "description": "In this course students will investigate how Muslims have elaborated on the revelation received by the Prophet Muhammad to build the social, cultural, and political institutions constitutive of Islamic societies. They will explore how gender, sexuality, race, and class functioned in the building of these institutions from 600 CE - 1600 CE across the Middle East, North Africa, Central and South Asia.",
        "term": null
    },
    {
        "name": "HIST 110 Indians of Columbia Plateau",
        "description": "This course will explore Native American groups on the Columbia Plateau, including their traditional lifestyles, traditional and colonial religions, the Salish language, and responses to settlement and government policies. We will also examine the traditions of cooperation and collaboration among these groups. We must understand the geography of the Plateau, in order to fully contextualize the importance of homeland and traditional practices, so this course represents place-based study of Native American history. Spring.",
        "term": "S"
    },
    {
        "name": "HIST 111 Intro to Native American Hist",
        "description": "Hundreds of Indigenous groups made their home in North America for centuries before European colonial expansion reached these shores. Native communities might describe this occupancy as ‘since time immemorial.’ This class will begin with an exploration of those earlier eras and will acknowledge that each Native community was/is distinct from other communities. Thus, while we can observe commonalities in Native experiences and histories, we will also conclude that there is no ‘single’ Native perspective. To develop this conclusion, we will assess processes of change over time across what we now know as the United States. This course will consider social and cultural approaches to preserving and passing down Native American histories as well as U.S. history interpretations of Native Americans’ societies, cultures, economies, and spiritualties. “Texts” in this course will include history books, literature, images, and film, and we will create and respond to research questions using primary and secondary sources.",
        "term": null
    },
    {
        "name": "HIST 112 World History",
        "description": "A survey of world history that examines global societies’ internal transformations as well as their interactions over time.",
        "term": null
    },
    {
        "name": "HIST 190 Directed Study",
        "description": "Topic to be determined by faculty.",
        "term": null
    },
    {
        "name": "HIST 193 FYS:",
        "description": "The First-Year Seminar (FYS) introduces new Gonzaga students to the University, the Core Curriculum, and Gonzaga’s Jesuit mission and heritage. While the seminars will be taught by faculty with expertise in particular disciplines, topics will be addressed in a way that illustrates approaches and methods of different academic disciplines. The seminar format of the course highlights the participatory character of university life, emphasizing that learning is an active, collegial process.",
        "term": null
    },
    {
        "name": "HIST 195 Special Topics",
        "description": "Selected historical topics of current and special interest.",
        "term": null
    },
    {
        "name": "HIST 200 Historical Foundations",
        "description": "This course is a preliminary introduction to the discipline of History.  It is a requirement for History majors and minors, and introduces methods used by historians. Special attention is paid to finding, evaluating, and using sources in ways appropriate to the discipline of History. It also teaches students how to consider the relevance of historical skills and knowledge to their professional and academic development. For History majors, it is the first of three required courses and a prerequisite for History 300—a course in which students practice many of the skills learned here in more sophisticated ways.",
        "term": null
    },
    {
        "name": "HIST 300 Historical Methods",
        "description": "HIST 300 is the second of three required courses for all History majors. Building on foundational skills developed in HIST 200, this course provides an in-depth discussion of the discipline of History and will help students further develop the skills necessary to contribute to the field. Students will explore a diversity of History specialties and engage in a variety of research and writing assignments. Instructors will guide students through various activities to hone their research and writing skills necessary to succeed.",
        "term": null
    },
    {
        "name": "HIST 302 The Ancient City",
        "description": "This course is a survey of the development of the city in the ancient world. Students will explore urban forms and processes as they are shaped by - and as they shape - their social, cultural, economic and physical contexts. The course will focus on representative urban centers of the ancient Near East, Egypt, and the Mediterranean world, tracing the evolution of ancient urbanism from the Near East to the classical worlds of Greece and Rome.",
        "term": null
    },
    {
        "name": "HIST 303 Athens in the 5th Century BC",
        "description": "The history of ancient Greece from the Bronze Age through the end of the fifth century BC, with special emphasis on the city of Athens and its political, social, and economic landscape during Classical Greece.",
        "term": null
    },
    {
        "name": "HIST 304 Alexander Grt and Hellen Wrld",
        "description": "The political, social, and cultural history of Greece and the Hellenistic World from 399 to 30 BC, from the death of Socrates to the death of Cleopatra. The course will focus particularly on the rise of Macedon as a Mediterranean power, the achievements of Alexander the Great, and the transformation of the eastern Mediterranean under the monarchies of the Hellenistic Period.",
        "term": null
    },
    {
        "name": "HIST 305 The Roman Republic",
        "description": "The political, social and cultural history of Republican Rome from its legendary origins to the Battle of Actium and its de facto end in 31 BC. The course will focus closely on the factors leading to the Republic's successful rise as uncontested Mediterranean ruler as well as the internal political and social conflicts that brought the Republic crashing down to its ultimate fall. (also offered through Gonzaga in Florence on an intermittent basis.)",
        "term": null
    },
    {
        "name": "HIST 306 The Roman Empire",
        "description": "The political, social and cultural history of Rome during the age of the Emperors, from Augustus' creation of the Principate in 27 BC to the decline of the Roman Empire in the west by the 5th century AD. Special focus in this course will be given to the workings of the Imperial system, daily life in Rome and the provinces, the rise of Christianity and the ultimate transformation of the empire.",
        "term": null
    },
    {
        "name": "HIST 307 Archaeology of Ancient Greece",
        "description": "This course examines the techniques and methods of classical archaeology as revealed through an examination of the major monuments and artifacts of Ancient Greece and its neighbors. Architecture, sculpture, vase and fresco painting, and the minor arts are all examined, from the Bronze Age through the Hellenistic period. We consider the nature of this archaeological evidence, and the relationship of classical archaeology to other disciplines such as history, art history, and the classical languages.",
        "term": null
    },
    {
        "name": "HIST 308 Archaeology of Ancient Rome",
        "description": "This course examines the techniques and methods of classical archaeology as revealed through an examination of the major monuments and artifacts of ancient Rome and its neighbors. Architecture, sculpture, vase and fresco painting, and the minor arts are all examined, from the Early Iron Age through the Late Roman period. We consider the nature of this archaeological evidence, and the relationship of classical archaeology to other disciplines such as history, art history, and the classical languages.",
        "term": null
    },
    {
        "name": "HIST 309 Italy: Homeland of the Romans",
        "description": "This course focuses on history, culture, society, religion, art, architecture, literature and daily life of the Romans, from Rome's beginnings in myth and legend through its rise to the domination of the Mediterranean world, its violent conversion from a Republic to an Empire and the long success of that Empire until its collapse in the fifth century A.D. Gonzaga in Florence only.",
        "term": null
    },
    {
        "name": "HIST 310 Native American Activism",
        "description": "Federal Indian policies and assertions of tribal sovereignty will provide context for discussions of Native American activism. We will discuss regional and national pan-Indian organizations, and we will also recognize the value of community-based activism. Local movements can include language preservation, restoration of traditional foods, community-designed and operated tribal museums and political engagement at all levels of government. Spring, every four years beginning 2014.",
        "term": "S"
    },
    {
        "name": "HIST 311 Medieval Europe",
        "description": "Developments in the first flowering of western Europe circa 500-1350, including feudalism, the rise of representative assemblies, the commercial revolution and the papal monarchy. Gonzaga in Florence only.",
        "term": null
    },
    {
        "name": "HIST 312 Renaissance Europe",
        "description": "A history of western Europe circa 1350-1550, examining the political, religious, social, and economic context for the cultural achievements of the humanists, artists, dramatists, scientists, architects, and educators of the age of Joan of Arc, Michelangelo, the Tudors, and the Medici.",
        "term": null
    },
    {
        "name": "HIST 315 Medieval Britain",
        "description": "A survey of the political, religious, social, and cultural history of the British Isles, circa 100-1485, examining Celtic, Roman, Anglo-Saxon, Viking, Norman, and Plantagenet interactions. Topics will include Christianization, the Viking and Norman invasions, Magna Carta and Parliament; relations of England, Wales, Scotland, and Ireland.",
        "term": null
    },
    {
        "name": "HIST 316 Tudor & Stuart Britain",
        "description": "British religious, political, social, cultural, and economic developments from the late 1400s to 1689, including the War of the Roses, the English Renaissance and Reformation, the Civil War and Restoration, and the Revolution of 1688.",
        "term": null
    },
    {
        "name": "HIST 317 History of Islamic Medicine",
        "description": "This course investigates the history of medicine in medieval to modern Islamic societies. Topics  to be studied include the reception of Greco-Roman, Persian, and Indian medicine in the medieval Islamic world, as well as the history of medical ethics, drug use, dieting, and sexual practice. Special attention will be paid to the ways in which medicine in the medieval to modern Islamic world shaped and was shaped by shifting intellectual discourses and dynamics of power.",
        "term": null
    },
    {
        "name": "HIST 320 Global History of Science",
        "description": "This course investigates the history of science in Europe, the Middle East, and Indian Ocean from antiquity to the early-modern period. It invites its participants to imagine ways of transcending the conventional opposition of these geographies and chronologies. Course participants will strive to understand Eurasia, the Mediterranean Basin, and Indian Ocean littoral as comprising an integral, brilliantly diverse region animated by shared textual and intellectual inheritances, and as an intercontinental community through which peoples, ideas, and objects enduringly circulated and interacted with one another.",
        "term": null
    },
    {
        "name": "HIST 321 Irish History Since 1500",
        "description": "This course has two purposes: to provide a broad overview of the major historical developments in Ireland from the seventeenth century to the twentieth century, and to introduce students to the historiographical debates that shape the study of modern Irish history. We will read about and discuss pivotal moments in Irish history during this time period, trying to understand what the primary agents of historical change in the country were, and what variable factors might have allowed the country’s history to follow a different path.",
        "term": null
    },
    {
        "name": "HIST 322 20th Century Northern Ireland",
        "description": "This course explores the troubled history of Northern Ireland from the perspective of the two communities that live within it, as well as that of the British and Irish governments. It examines key events in Northern Ireland’s recent history such as Bloody Sunday, internment, the murder of Lord Mountbatten, the hunger strikes, the Enniskillen and Omagh bombings, and the steps to the Peace Process. The course emphasizes how peace has been achieved in the wake of the \"Troubles\" as it examines whether the Good Friday Agreement can offer lessons to other conflict zones around the world.",
        "term": null
    },
    {
        "name": "HIST 323 Disunited Kingdom",
        "description": "In this course, we will explore how Britain and Britishness are modern constructions. We will begin our analysis by studying the ancient and medieval connections between the nations we know today as England, Ireland, Scotland, and Wales, and then explore how the United Kingdom came into being. The latter part of the course will focus on how tension remains between these older national Identities and a more modern sense of unified Britishness.",
        "term": null
    },
    {
        "name": "HIST 329 Nazi Germany",
        "description": "This course examines German politics and society during the Weimar and Nazi periods. Its main emphasis is the relationship between the German people, Adolf Hitler, and the Nazi Party, and the impact that Nazism had on German society and institutions. The course further emphasizes the Nazi regime's foreign policy objectives as well as its racial goals, each of which found their fullest expression during World War II and the Holocaust. As these extremes aspect of the Third Reich pose the central problems of modern European history, students who complete this course will become familiar with the documents and historiography that inform the history of the Nazi era.",
        "term": null
    },
    {
        "name": "HIST 330 The Holocaust",
        "description": "A history of the Nazi genocide of the Jews in World War II, including its origins and historical context, the methods used by the Nazis to identify and exterminate victims, a study of the perpetrators, the reaction of the international community, and post-war historiography, interpretation and commemoration. Gonzaga in Florence only.",
        "term": null,
        "prerequisites": {
            "type": "or",
            "requirements": [
                {
                    "course": ""
                },
                {
                    "course": "HIST 112H Minimum Grade: D"
                }
            ]
        }
    },
    {
        "name": "HIST 331 World War II",
        "description": "The causes, conduct and consequences of the Second World War.",
        "term": null
    },
    {
        "name": "HIST 334 Russia & USSR Since 1945",
        "description": "This course may be considered an autopsy on the Soviet empire.  Its themes include:  \"developed\" socialism under Stalin's successors; the rise and decline of the Soviet economy; the Cold War; the Soviet Union's nationalities issues; the impact of Gorbachev's reforms; and the collapse of the USSR.  The course will also consider the domestic and foreign policy challenges faced by Yeltsin and Putin after 1991.",
        "term": null
    },
    {
        "name": "HIST 336 History of Food",
        "description": "What historical processes have determined how Italians (and others) eat today? What role does food production and consumption play in history? This course is an investigation of humans in the Mediterranean and the food they eat and cultivate, and it will help us understand that the food we eat is the product of a historical process. Gonzaga in Florence only.",
        "term": null
    },
    {
        "name": "HIST 337 The Stalin Era",
        "description": "This course focuses on the dictatorship of Josef Stalin from the late 1920s until his death in 1953. Its main topics include: Stalin's consolidation of personal rule; the impact of crash industrialization and agricultural collectivization; Stalinist terror; the Soviet experience in World War II; the worldwide influence of the Soviet model after the war; and the legacy of Stalinism in Russia.",
        "term": null
    },
    {
        "name": "HIST 338 Fascist Italy",
        "description": "Italian history from 1918 to 1945, including an examination of social and economic conditions in post-World War Italy, rise of the Fascist Party, the role of Benito Mussolini, the nature of Fascist government in Italy, Italian imperialism under Mussolini, and the part played by Italy as an ally with Hitler's Germany. Offered through Gonzaga in Florence on an intermittent basis.",
        "term": null
    },
    {
        "name": "HIST 339 Modern France: 1789 to Present",
        "description": "Since the late eighteenth century, the French have experimented with a multitude of political arrangements, from absolute monarchy to radical utopian visions of socialism. ln this light, modern France might be imagined to have been a political laboratory, providing inspiration (or dread) for much of the rest of Europe. Beginning with the revolution of 1789, this course will explore the political volatility experienced in France over the next two centuries.",
        "term": null
    },
    {
        "name": "HIST 340 The Cold War",
        "description": "The focus of this course is the ideological and geopolitical confrontation between the superpowers that shaped the second half of the twentieth century. The course analyzes the origins of the Cold War, its global manifestations in Europe and the non-western world, as well as the effects of the Cold War on American and Soviet societies and cultures.",
        "term": null
    },
    {
        "name": "HIST 341 African Nationalism",
        "description": "This course examines closely African countries' internal histories as they transitioned from colony to nation from the 1940s through the 1990s. While not ignoring the roles played by colonial masters and indigenous elites, the heart of the course explores how ordinary men and women shaped these processes.",
        "term": null
    },
    {
        "name": "HIST 342 African History through Film",
        "description": "This course explores African history by examining the roles that Africans have played historically as creators, audiences, and subjects of films. Using both film studies and African studies concepts, the course interrogates African film as both artifacts and interpretations of the past.",
        "term": null
    },
    {
        "name": "HIST 343 Colonial Africa",
        "description": "This course examines the colonial period through the lived realities of Africans themselves. In particular, it considers the ways in which African and colonial systems of economics, politics, gender, and community were brought into dynamic tension during the decades of colonial rule.",
        "term": null
    },
    {
        "name": "HIST 344 African Health and Healing",
        "description": "This class interrogates how African understandings of health and practices of healing transformed from the precolonial through the post-independence periods. In particular, we will study the interrelationship between health and politics in African thought, the integration of western biomedicine into African systems of healing, and the changing disease landscape of capitalism, colonialism, and globalization.",
        "term": null
    },
    {
        "name": "HIST 345 African Environmental History",
        "description": "This course explores the long-term history of Africans' dynamic interactions with their environments by interrogating how African environmental realities and Africans' conceptions of the environment shaped broader political, social and economic histories. Beginning in the precolonial period, we will trace how climatic variation, political and economic changes in the colonial period, and post-independence priorities transformed Africans' relationships with their environments.",
        "term": null
    },
    {
        "name": "HIST 350 The City in American History",
        "description": "How, when, and why did cities in America develop where they did? How do physical form and institutions vary from city to city and how are these differences significant? This course will explore these and other questions while emphasizing twentieth-century American cities. We will examine urban populations, city culture, crime, municipal politics, and sustainability.",
        "term": null
    },
    {
        "name": "HIST 352 The Early American Republic",
        "description": "This course examines the critical period of the young United States from the American Revolution until approximately 1850. Topics covered include: immigration, expansion, nationalism, conceptions of race and ethnicity, labor, slavery, gender, reform movements, industrialization, Native American/U.S. relations, popular democracy and religion. All of these will be considered in light of the processes by which the United States began to cohere as a nation both politically and culturally.",
        "term": null
    },
    {
        "name": "HIST 353 US Civil War & Reconstruction",
        "description": "Although this class will center around the American Civil War (1861-1865), it will even more so be a history of the United States from approximately 1820 through 1880, in order to effectively place the war in its appropriate historical contexts of the political, economic, social, and cultural history of the mid-nineteenth century. This course will examine the nature and creation of regional distinctiveness in the United States, the centrality of race and slavery to the nation, the causes of disunion, the nature and character of the Civil War which followed, the war's diverse effects on the whole American populace, the nation's attempt at reconstruction, and the war's legacies that still inform our nation today.",
        "term": null
    },
    {
        "name": "HIST 354 American Latina/o History",
        "description": "An introduction to the history of American Latina/o communities from the nineteenth-century wars that brought northern Mexico, Cuba, and Puerto Rico under U.S. control; through the first major waves of immigration that brought Mexicans and other Latinas/os to the U.S.; through multiple generations of hardship, cultural transformation, and political mobilization; and finally to the issues and challenges of the early twenty-first century. Themes and topics include military conquest and resistance, immigration, discrimination and segregation, labor and migration, community formation, gender and sexuality, military service, religious faith and activism, civil rights activism, the farmworker movement, cultural nationalism, the evolution of diverse Latinx identities, and the overarching context of U.S. relations with Latin America.",
        "term": null
    },
    {
        "name": "HIST 355 The American West",
        "description": "An introduction to the history of the region. The course offers an overview of regional settlement, cultural diversity, social relations, economic development, urban growth, and politics. The course also explores the meaning of the West to the nation through the work of writers and filmmakers.",
        "term": null
    },
    {
        "name": "HIST 358 African-American History",
        "description": "This course explores the lives and experiences of African -Americans from the colonial era to the present. This seminar-style course allows students to examine historic changes in communities, values, obstacles, activism, and traditions that sustained these citizens, workers, families, communities, and activists.",
        "term": null
    },
    {
        "name": "HIST 359 Indigenous Early America",
        "description": "This course will explore the history of Early America through Indigenous perspectives. It will consider the rich and diverse histories of North American tribes, analyze their varied responses to the processes of colonization, and connect these legacies to the present. Topics discussed include political engagement, commodities exchange, resource competition, religious encounters, gender roles, slavery, and racialization. Lectures, discussions, activities, and research will challenge students to reimagine colonial North America as Native America by centering Indigenous actors.",
        "term": null
    },
    {
        "name": "HIST 360 Pacific Northwest History",
        "description": "The social, economic, political, and cultural development of the Pacific Northwest from the late eighteenth century to the present. The primary geographical focus is on Washington, Oregon, and Idaho. The course focuses on three overarching themes: the region’s social and cultural diversity, competition over the region’s natural resources, and the development of regional identity.",
        "term": null
    },
    {
        "name": "HIST 361 Post-WWII Presidency",
        "description": "The post-1945 presidency evolved and changed drastically as consequence of domestic and foreign events and ideology.  We will examine the powers and limitations of the post-1945 U.S. presidents in both foreign and domestic affairs.  We will assess their relationships with Congress, the American people, the press, and other nations, and we will explore presidential power, agenda, persuasion, secrecy, and character.",
        "term": null
    },
    {
        "name": "HIST 362 U.S. Foreign Policy Since 1945",
        "description": "HIST 362 will examine the United States' foreign policies formulated and implemented after World War 11, during and immediately after the Cold War, and in the post-9/11 era. We will discuss NATO and our relationship with the European nations and evaluate U.S. policies in Asia, particularly our actions in Vietnam and our relationship with China. We will also assess the U.S. role in Latin America and Africa, and diplomacy and conflict in the Middle East.",
        "term": null
    },
    {
        "name": "HIST 363 Women in United States History",
        "description": "This course explores the history of American women from the colonial era to the present using a women and gender studies framework. The class investigates gender roles and the ways that race, class, politics, national origin, colonization, and the passage of time alter those expectations. This seminar style course investigates women’s economic and political lives and social contributions through suffrage, reform, civil rights, feminism, and more.",
        "term": null
    },
    {
        "name": "HIST 364 Public History",
        "description": "Why are people drawn to the past? When they go searching for it, where do they go, and what do they find? What should they find? This course examines the practice and politics of “public history.” As we will see, public historians work as museum curators, historic preservationists, historic site interpreters, archivists, film consultants, writers, and editors. In these and other roles, public historians help individuals and organizations recognize, contend with, and learn from the complexities of the past. Through weekly readings, site visits, guest speakers, and hands-on project experience, this course will introduce students to the challenges and rewards that accompany engagement with and employment within the field of public history.",
        "term": null
    },
    {
        "name": "HIST 365 Environmental History",
        "description": "In examining the dynamic relationship between humans and their environment over time, this course explores how nature affects cultural responses and how humans, in turn, have shaped the world around them. Employing a multidisciplinary approach this course draws upon ecological, historical, economic, or political analysis to illuminate the varied relationships between people and place.",
        "term": null
    },
    {
        "name": "HIST 366 American Cultures and Ideas",
        "description": "This course will examine American history through an exploration of its culture. Throughout this course we will work towards defining what culture is, how it shapes expectations and assumption, how it motivates human actions and interactions, and how it is bound by time and place. Each student’s ability to critically read cultural sources from an appropriately historical frame of reference will be tested in a variety of assignments, including weekly readings, writing assignments, and active class participation.",
        "term": null
    },
    {
        "name": "HIST 367 Rights Justice & US Citizenshp",
        "description": "This course explores the history of citizenship in the United States from its founding in the Revolutionary era to the present by examining how and why the rights and obligations of citizenship have changed over time. This seminar style course includes discussions of philosophical and theoretical frameworks involved in building and in understanding citizenship including reform efforts that aspired to democratize institutions that treated citizens differently because of race, ethnicity, class, national origin, or gender. This course is geared towards students interested in history, law, politics, ethnic studies, women’s studies, and social movements.",
        "term": null
    },
    {
        "name": "HIST 368 The U.S. in the World",
        "description": "This course will introduce you to the history of the United States in its global context. In\norder to situate the United States within its world, this course explores the interconnections\nbetween domestic beliefs, national policy, and international events.",
        "term": null
    },
    {
        "name": "HIST 369 A History of Race in America",
        "description": "Why is there race? This course will examine the history of the inventions, transformations and expressions of the idea of race as a category of difference in American thought and experience from pre-contact to the present. The course will consider intellectual, cultural, legal, social, economic, and political manifestations of this idea, with special attention given to how the idea has been applied and experienced in diverse ways across North America over time.",
        "term": null
    },
    {
        "name": "HIST 370 Fnd of East Asian Civilization",
        "description": "This course seeks to give students an understanding of the history and culture of pre-modern China, Japan, Korea, and Vietnam. After exploring the historical roots of Confucianism, Daoism and Buddhism in China, students will examine the ways in which these foundational philosophies helped form social, cultural, and political institutions in China and its neighbors. Students will also focus attention on the historical emergence of the Chinese imperial system, and its greatest pre-modern exemplars, the Qin, Han and T'ang dynasties. Not limiting the focus to China alone, students will also explore how the concept of China as the \"middle kingdom\" influenced the language, religion and political developments in Japan and Korea, leading to an authentic \"macro-culture\" in East Asia. The course will finish with a discussion of samurai culture and an analysis of how the Mongol conquests of Central and East Asia transformed the region, taking students to the threshold of the early modern period in Asia. It is desired, but not required, that students take HIST 112 prior to this course.",
        "term": null
    },
    {
        "name": "HIST 371 Modern Pacific World",
        "description": "This course brings together the histories of Asia, the Americas, and Oceania since the 18th century by examining how human migration in and throughout the Pacific region and reshaped it over time. Investigating sojourners, merchants, laborers, soldiers, imperial administrators, colonial subjects, women, and business elites allows us to understand changes in economic exchange, political influence, geographic knowledge, racial beliefs, the rise and fall of empires, and the era of globalization.",
        "term": null
    },
    {
        "name": "HIST 372 China Past and Present",
        "description": "This course is a focused survey of Chinese history from the Shang Dynasty (c. 1600 B.C.) up to the present. Using the standard interpretive categories of politics, economics, society, and culture, the course will explore such topics as pre-imperial China; the Qin-Han consolidations and breakdowns; pre-modern Imperial China (Jin, Sui, Tang, Song, including inter-dynasty kingdoms); the Mongol (Yuan) dynasty; early modern and modern imperial China (Ming and Qing); and the Revolutionary periods of the twentieth century, including the Guomindang era, Maoism, and Post-Mao modernizations. Students who take this course for International Studies credit will be required to do an extra writing assignment that integrates the material of this course with their International Studies focus. It is desired but not required that students will have taken History 112 prior to taking this course",
        "term": null
    },
    {
        "name": "HIST 373 Japan Past and Preesnt",
        "description": "This course is a focused survey of Japanese history from the Jomon Period (c. 14,000 B.C) up to the present. Using the standard interpretive categories of politics, economics, society, and culture, the course will explore such topics as the Jomon and Yayoi classical ages; the Yamato, Nara, and Heian aristocratic ages; the Kamakura, Ashikaga, and Tokugawa warrior ages, and the modern period from the Meiji Restoration through the twentieth century. Students who take this course for International Studies credit will be required to do an extra writing assignment that integrates the material of this course with their International Studies focus. It is desired but not required that students will have taken History 112 ) prior to taking this course.",
        "term": null
    },
    {
        "name": "HIST 374 Maoist China",
        "description": "This course is an in-depth study of China during the revolutionary twentieth century, focused upon the career of People's Republic of China Chairman Mao Zedong. In addition to analyzing the political, economic, social, and cultural developments of post-imperial China, the course takes a look at the theory of revolution, and examines China's historical development in the context of imperialism, post colonialism, and international Marxist revolution. It is desired, but not required, that students take HIST 112 prior to this course.",
        "term": null
    },
    {
        "name": "HIST 376 Tokugawa Japan",
        "description": "This course is an in-depth study of Japan's \"early modern\" period, covering the years of the Tokugawa Shogunate (1603-1868). In addition to analyzing the political, economic, social, and cultural developments of Japan's centralized feudal period, the course takes a look at the theory of modernity and examines Japan's historical development in the context of modernization.",
        "term": null
    },
    {
        "name": "HIST 378 Zen Modernity & Counterculture",
        "description": "This course is an in-depth study of the historical relationship between modern Japanese Zen Buddhism and the American counter-culture of the post WWII period. Through readings and discussions of a number of religious, literary and historical works, the course explores the degree to which the modern \"reinvention\" of an ancient Japanese religious tradition has influenced, and continues to influence western popular culture.",
        "term": null
    },
    {
        "name": "HIST 379 Technology & Human World",
        "description": "This course will provide a comprehensive survey of the development of science and technology in the context of world history and will invite students to take part in a critical engagement of the mutually productive qualities of history and technology in a context of modernization.",
        "term": null
    },
    {
        "name": "HIST 380 Colonial Latin America",
        "description": "A survey of colonial Latin America that examines the contact, conflict, and accommodation among Europeans, Native Americans, and Africans that shaped colonial Latin America.",
        "term": null
    },
    {
        "name": "HIST 381 Modern Latin America",
        "description": "A general introduction to the history of the former colonies of Spain and Portugal in the Western Hemisphere. Topics include the rise of caudillos, rural developments, the emergence of liberal economic development, populism, banana republics, dictatorships, dirty wars, Marxist revolution, and contemporary predicaments.",
        "term": null
    },
    {
        "name": "HIST 382 Revolutions in Mod Latin Amer",
        "description": "This course examines the origins, emergence, process, and consequences of major Latin American social and political revolutions in the twentieth century. It will investigate a variety of types of revolutions including different urban and rural movements, as well as groups that sought radical change from high politics to the grass roots level.",
        "term": null
    },
    {
        "name": "HIST 383 Mexico",
        "description": "A survey of Mexican history from the Aztec wars to the present.",
        "term": null
    },
    {
        "name": "HIST 384 Women in Colonial Latin Amer",
        "description": "This course will investigate the lives of women in both the pre-contact and post-conquest societies. The first part of the course concentrates on the activities of women, and their role in society, among the Aztecs, Inca, and Pueblo civilizations. The course will follow with the study of their experiences after the Spanish Conquest. The final section of the course will cover the variety of women, ranging from wealthy Spanish women, established nuns, marginal mystics, Indian leaders, and African women, and their experiences in the Spanish colonies. In class, students will learn about and discuss the various gender systems which operated in different periods, and how these systems shaped women's lives as women shaped the systems themselves.",
        "term": null
    },
    {
        "name": "HIST 389 HistoryPlays:FactFictionStory",
        "description": "In the twenty-first century, American playwrights have increasingly begun to draw upon history to create dramas and comedies which add nuance and context to stories audiences think they already know. This class will use historiography - the study of historical writing - to reveal who has written history and why those scholars were imbued with authority to write the narratives they did. At the same time, we will investigate how playwrights are drawing upon/challenging/complicating those narratives and we will consider what “authority” means when Native-authored content, for example, is placed side-by-side with scholarship about (not by) Native people. If you like stories, reading, and understanding why writing about the past carries both power and responsibility, this class is for you.",
        "term": null
    },
    {
        "name": "HIST 390 Topics in History",
        "description": "Selected historical topics of current and special interest.",
        "term": null
    },
    {
        "name": "HIST 391 Topics in History",
        "description": "Selected historical topics of current and special interest.",
        "term": null
    },
    {
        "name": "HIST 392 Topics in History",
        "description": "Selected historical topics of current and special interest.",
        "term": null
    },
    {
        "name": "HIST 393 Topics in History",
        "description": "Selected historical topics of current and special interest.",
        "term": null
    },
    {
        "name": "HIST 394 Topics in History",
        "description": "Selected historical topics of current and special interest.",
        "term": null
    },
    {
        "name": "HIST 395 Topics: History (Study Abroad)",
        "description": "Selected historical topics of current and special interest.",
        "term": null
    },
    {
        "name": "HIST 396 Topics in History",
        "description": "Selected historical topics of current and special interest.",
        "term": null
    },
    {
        "name": "HIST 398 Topics in History",
        "description": "Selected historical topics of current and special interest.",
        "term": null
    },
    {
        "name": "HIST 399 Topics in History",
        "description": "Selected historical topics of current and special interest.",
        "term": null
    },
    {
        "name": "HIST 400 Senior Thesis - Seminar",
        "description": "HIST 400 is the History capstone course, designed as a research seminar for majors. Students will continue to develop their understanding of the methods and skills of contemporary historical practice. They will demonstrate their mastery of the discipline through discussions, assignments, peer review, and the research and writing of a thesis project using relevant primary and secondary sources.",
        "term": null,
        "prerequisites": {
            "course": "HIST 300 Minimum Grade: D"
        }
    },
    {
        "name": "HIST 432 CIS:",
        "description": "The Core Integration Seminar (CIS) engages the Year Four Question: “Imagining the possible: What is our role in the world?” by offering students a culminating seminar experience in which students integrate the principles of Jesuit education, prior components of the Core, and their disciplinary expertise. Each section of the course will focus on a problem or issue raised by the contemporary world that encourages integration, collaboration, and problem solving. The topic for each section of the course will be proposed and developed by each faculty member in a way that clearly connects to the Jesuit Mission, to multiple disciplinary perspectives, and to our students’ future role in the world.",
        "term": null
    },
    {
        "name": "HIST 490 Directed Reading and Research",
        "description": "Topic to be determined by faculty.",
        "term": null
    },
    {
        "name": "HIST 497 Internship",
        "description": "Students will apply historical methods and analytical skills at a non-profit or for-profit site such as a museum, archive, preservation office, government office, or other research or historical site. Instructor permission required to register.",
        "term": null
    },
    {
        "name": "HIST 498 Advanced Historical Writing",
        "description": "This course is designed for students who have taken HIST 300 or HIST 400 and who wish to improve their historical and writing skills by continuing work on their research papers.",
        "term": null,
        "prerequisites": {
            "course": "HIST 300 Minimum Grade: D"
        }
    },
    {
        "name": "HIST 499 Thesis",
        "description": "In exceptional cases only, this course may be taken in lieu of HIST 400 with the permission of the Department Chair of History.",
        "term": null
    }
]