[
    {
        "name": "NTAS 101 Intro Native American Studies",
        "description": "This course will explore the histories and cultures of Indigenous groups in North America. While the course will primarily focus on the 19th and 20th centuries, we will also explore Native experiences in early America, and will contextualize later events with those interactions. We will examine Native responses to white settlement, diverse Native reservation experiences, and Native engagement with assimilationist policies like boarding schools and relocation to urban areas. We will also consider the modern era, including outcomes of the self-determination movement for more Native control over tribal governance and economic development. We will engage with literature, film, autobiography, and museum studies to explore these topics, while assessing them from a Native American Studies foundation. Fall.",
        "term": "F"
    },
    {
        "name": "NTAS 193 FYS:",
        "description": "The First-Year Seminar (FYS) introduces new Gonzaga students to the University, the Core Curriculum, and Gonzaga’s Jesuit mission and heritage. While the seminars will be taught by faculty with expertise in particular disciplines, topics will be addressed in a way that illustrates approaches and methods of different academic disciplines. The seminar format of the course highlights the participatory character of university life, emphasizing that learning is an active, collegial process.",
        "term": null
    },
    {
        "name": "NTAS 199 Indigenous Science",
        "description": "Biology is the modern scientific study of life and the natural living world. This area of science has provided us with impressive advancements in our understanding of the natural world and human health. However, there exists an enormous amount of traditional indigenous knowledge about the natural world as well. This traditional knowledge is often complementary and convergent with modern science. However, there are significant differences in the ways that these different disciplines look at the world, and differences in what these perspectives can tell us. Spring, odd years.",
        "term": "SO"
    },
    {
        "name": "NTAS 199L Biology & Indigenous Sci Lab",
        "description": "See NTAS 199.",
        "term": null
    },
    {
        "name": "NTAS 201 Philosophy of Human Nature",
        "description": "Philosophy of Human Nature. Philosophical study of human nature, the human condition, the meaning and value of human life, and the human relationship to ultimate reality, with attention to such issues as the nature and possible existence of the soul, the relation between body and mind, belief and knowledge, freedom vs. determinism, and the possibility of human immortality.",
        "term": null
    },
    {
        "name": "NTAS 210 Indians of Columbia Plateau",
        "description": "This course will explore Native American groups on the Columbia Plateau, including their traditional lifestyles, traditional and colonial religions, the Salish language, and responses to settlement and government policies. We will also examine the traditions of cooperation and collaboration among these groups. We must understand the geography of the Plateau, in order to fully contextualize the importance of homeland and traditional practices, so this course represents place-based study of Native American history. Spring.",
        "term": "S"
    },
    {
        "name": "NTAS 211 Intro Native American History",
        "description": "Hundreds of Indigenous groups made their home in North America for centuries before European colonial expansion reached these shores. Native communities might describe this occupancy as ‘since time immemorial.’ This class will begin with an exploration of those earlier eras and will acknowledge that each Native community was/is distinct from other communities. Thus, while we can observe commonalities in Native experiences and histories, we will also conclude that there is no ‘single’ Native perspective. To develop this conclusion, we will assess processes of change over time across what we now know as the United States. This course will consider social and cultural approaches to preserving and passing down Native American histories as well as U.S. history interpretations of Native Americans’ societies, cultures, economies, and spiritualties. “Texts” in this course will include history books, literature, images, and film, and we will create and respond to research questions using primary and secondary sources.",
        "term": null
    },
    {
        "name": "NTAS 241 Indigenous Lit Alaska Hawai'i",
        "description": "This course explores Native Hawai’ian and Alaska Native cultures through their literatures. We will contextualize nonfiction and literary texts alike in the complicated histories of the lands that are now the United States’ 49th and 50th states in terms of their Indigenous cultures and inhabitation, the annexation by the U.S., and the controversial moves into statehood in 1959. We will interrogate historical and contemporary realities and debates within and beyond Alaska and Hawai’i regarding sovereignty movements and U.S. imperialism, positioning these literatures in a trans-Indigenous global context. In this way we will work toward sophisticated understandings of important contributions to contemporary American literatures and the complexities of the contexts that influence literary production in Hawai’i, Alaska, and the world. All of the activities and assignments are designed to demonstrate the role of literature in transnational politics of representation and the importance of formal and informal literary and textual analysis in the development of global awareness and citizenship.",
        "term": null
    },
    {
        "name": "NTAS 290 Special Topics",
        "description": "Topic to be determined by instructor.",
        "term": null
    },
    {
        "name": "NTAS 310 Native American Activism",
        "description": "Federal Indian policies and assertions of tribal sovereignty will provide context for discussions of Native American activism. We will discuss regional and national pan-Indian organizations, and we will also recognize the value of community-based activism. Local movements can include language preservation, restoration of traditional foods, community-designed and operated tribal museums and political engagement at all levels of government. Spring, every four years beginning 2014.",
        "term": "S"
    },
    {
        "name": "NTAS 311 Native American Govt & Politic",
        "description": "This course will see Native American government and politics in a milieu of intergovernmental relations, of community to community connections, or the lack of such relationships. Taking social justice as importantly about relationships, and doing so in respect of governing, this course will to study how (or how not) federal, state, and municipal governments interact with Native American governments. Spring, even years.",
        "term": "SE"
    },
    {
        "name": "NTAS 320 Native American Art & Perform",
        "description": "This course will explore Native American modern art and the historical cultural and artistic practices which informs it. We will also explore Museum Studies as a profession of power and cultural continuity for Native American tribes, and we will review scholarship on Native American museums, including the National Museum of the American Indian. Finally, we will consider performance, in numerous contexts. How does ritual reflect both spirituality and performance? Spring, every four years beginning 2015.",
        "term": "S"
    },
    {
        "name": "NTAS 321 American Indian Literatures",
        "description": "This course is designed to introduce students to several important texts in the multifaceted genre of American Indian literature as well as to invite students into a critical discussion of contemporary issues centering on the relationship between American Indian literatures and contemporary sociopolitical and -cultural realities and issues. We will examine the role of American Indian literature in the continual process of cultural maintenance as well as identity (re-)construction. Through close reading of texts by writers from various tribes and regions, students will explore the heterogeneity of Native America and the complexities of all attempts to define or shape indigenous nationhood in the United States. We will contextualize these texts in discussions of social justice issues particular to Native America, including but not limited to the five definitions of genocide; geographical and cultural displacements; and \"third world\" living conditions. We will also be engaged in dialogues about local and national American Indian cultures in cooperation with the American Indian Studies house on campus. Spring, odd years.",
        "term": "SO"
    },
    {
        "name": "NTAS 322 Native American Religions",
        "description": "Traditional Native cultures and contributions along with the cultural stereotypes that distort their reality.  Includes the role of Christian missions in forming contemporary Native realities and studies the revitalization movements among North American tribes.",
        "term": null
    },
    {
        "name": "NTAS 340 Global Indigeneity",
        "description": "This course is designed to explore the pre-colonial indigenous populations of North and South America, Australia, and New Zealand, and to compare the experiences of these groups as they encountered settlers and persisted throughout colonization processes. Every four years beginning 2019.",
        "term": null
    },
    {
        "name": "NTAS 341 Colonial Latin America",
        "description": "A survey of colonial Latin America that examines the contact, conflict, and accommodation among Europeans, Native Americans, and Africans that shaped colonial Latin America.",
        "term": null
    },
    {
        "name": "NTAS 359 Indigenous Early America",
        "description": "This course will explore the history of Early America through Indigenous perspectives. It will consider the rich and diverse histories of North American tribes, analyze their varied responses to the processes of colonization, and connect these legacies to the present. Topics discussed include political engagement, commodities exchange, resource competition, religious encounters, gender roles, slavery, and racialization. Lectures, discussions, activities, and research will challenge students to reimagine colonial North America as Native America by centering Indigenous actors.",
        "term": null
    },
    {
        "name": "NTAS 389 HistoryPlays:FactFictionStory",
        "description": "In the twenty-first century, American playwrights have increasingly begun to draw upon history to create dramas and comedies which add nuance and context to stories audiences think they already know. This class will use historiography — the study of historical writing — to reveal who has written history and why those scholars were imbued with authority to write the narratives they did. At the same time, we will investigate how playwrights are drawing upon/challenging/complicating those narratives and we will consider what “authority” means when Native-authored content, for example, is placed side-by-side with scholarship about (not by) Native people. If you like stories, reading, and understanding why writing about the past carries both power and responsibility, this class is for you.",
        "term": null
    },
    {
        "name": "NTAS 390 Native American Studies Topics",
        "description": "Topics to be determined by instructor.",
        "term": null
    },
    {
        "name": "NTAS 432 CIS:",
        "description": "The Core Integration Seminar (CIS) engages the Year Four Question: “Imagining the possible: What is our role in the world?” by offering students a culminating seminar experience in which students integrate the principles of Jesuit education, prior components of the Core, and their disciplinary expertise. Each section of the course will focus on a problem or issue raised by the contemporary world that encourages integration, collaboration, and problem solving. The topic for each section of the course will be proposed and developed by each faculty member in a way that clearly connects to the Jesuit Mission, to multiple disciplinary perspectives, and to our students’ future role in the world.",
        "term": null
    },
    {
        "name": "NTAS 490 Directed Study",
        "description": "Topic to be decided by faculty.",
        "term": null
    },
    {
        "name": "NTAS 497 Exper Learning: Internship",
        "description": "Professional work experience in a field related to Native American Studies.",
        "term": null,
        "prerequisites": {
            "course": "NTAS 101 Minimum Grade: D"
        }
    },
    {
        "name": "NTAS 498 Experiential Learning:Research",
        "description": "The Native American Studies minor at Gonzaga University requires completion of an experiential learning project. The project may either be an internship or a research paper. Must have permission of the NTAS Program Director. Fall, Spring, and Summer.",
        "term": "S",
        "prerequisites": {
            "course": "NTAS 101 Minimum Grade: C"
        }
    }
]