[
    {
        "name": "POLS 101 Intro to American Politics",
        "description": "The American Constitution: the evolution of democracy and the structure of the national government. Congress: the Presidency and the courts. Political parties and interest groups. Public policy in domestic and foreign affairs. How to think about politics. Fall and Spring.",
        "term": "FS"
    },
    {
        "name": "POLS 102 Political Thought & Action",
        "description": "This course is designed to be an introduction to the political science subfield of political thought. The course will cover central texts and problems of political theory with an emphasis on using theoretical insights to guide action. Themes may include freedom, justice, equality, democracy, and authority, though the emphases will vary from semester to semester. Fall and Spring.",
        "term": "FS"
    },
    {
        "name": "POLS 103 Intro to Comparative Politics",
        "description": "Comparison of key political institutions, political attitudes, patterns of interaction, and long-term quarrels in selected countries from Europe, Middle East, Asia, Africa and Latin America. How legislatures, executives, and political parties work and the influence of culture, social structure, ideology, and nationalism. Fall.",
        "term": "F"
    },
    {
        "name": "POLS 104 Intro International Relations",
        "description": "This course is designed to be an introduction to the political science subfield of international relations. The course will cover the major theoretical perspectives in international relations, security and economic relations between states, and global challenges that states face from non-state actors and the environment. Fall and Spring.",
        "term": "FS"
    },
    {
        "name": "POLS 190 Directed Study",
        "description": "Topic to be determined by instructor.",
        "term": null
    },
    {
        "name": "POLS 193 FYS:",
        "description": "The First-Year Seminar (FYS) introduces new Gonzaga students to the University, the Core Curriculum, and Gonzaga’s Jesuit mission and heritage. While the seminars will be taught by faculty with expertise in particular disciplines, topics will be addressed in a way that illustrates approaches and methods of different academic disciplines. The seminar format of the course highlights the participatory character of university life, emphasizing that learning is an active, collegial process. Spring.",
        "term": "S"
    },
    {
        "name": "POLS 201 Political Thought & Praxis",
        "description": "This course serves as an introduction to the field of political theory for students of political science. The concepts considered include democracy, equality, freedom, and justice with examination of additional fundamental concepts informed by instructor preference and contemporary political events. Students in this course will acquire the knowledge and skills necessary to evaluate theory and, importantly, apply it to political\npractice (praxis). Fall Semester.",
        "term": "F"
    },
    {
        "name": "POLS 202 How to Study Politics",
        "description": "This course introduces Political Science majors to the research methods used in the discipline of Political Science. In addition to developing fundamental research skills for Political Science majors, it teaches students how to fact-check and evaluate sources and to think critically about information gleaned from a variety of media.",
        "term": null
    },
    {
        "name": "POLS 301 Politics of Food",
        "description": "Examines the nature and origins of local, state, and federal policies impacting the U.S. food system. Major topics include food safety, nutrition guidelines, the problems of hunger and obesity. Significant attention is paid to the interplay of ordinary citizens, corporations, and local, state and federal governments and the role of each in the policy making process. Spring, alternate years. Offered occasionally.",
        "term": "S"
    },
    {
        "name": "POLS 303 Constitutn Law,Civl Libty,Rgts",
        "description": "A case-based examination of Supreme Court decisions treating aspects of the Bill of Rights and the Fourteenth Amendment. These decisions cover topics such as freedom of speech, freedom of the press, religious freedoms, the right to privacy, and questions of discrimination in its many forms, including racial, sexual, and voting rights. Spring.",
        "term": "S"
    },
    {
        "name": "POLS 306 Congress and the Presidency",
        "description": "The Congress, its rules and procedures, committee and party leadership, and the influence of Congress on national policy. The Presidential office, its constitutional powers and its evolution over the years. The \"modern presidency\" since Franklin Roosevelt. Conflict and co-operation between the Congress and the President. Spring.",
        "term": "S"
    },
    {
        "name": "POLS 309 Political Parties and Election",
        "description": "How our nation's political parties are organized inside and outside government. Whether they are weak or strong. Occasional efforts to reform parties. Their role in elections. Other influences on presidential and congressional elections. The conduct of election campaigns. How voters make up their minds. Explaining election outcomes. Fall, even years.",
        "term": "FE"
    },
    {
        "name": "POLS 310 Native American Govt & Politic",
        "description": "This course will see Native American government and politics in a milieu of intergovernmental relations, of community to community connections, or the lack of such relationships. Taking social justice as importantly about relationships, and doing so in respect of governing, this course will to study how (or how not) federal, state, and municipal governments interact with Native American governments. Spring, even years.",
        "term": "SE"
    },
    {
        "name": "POLS 311 State & Local Government",
        "description": "Surveys state and local government: intergovernmental relations, finance, state sovereignty, shifts in federalism and social policy, politics of urban and rural regions. State election systems may be studied for their significant influence over national elections. Offered occasionally.",
        "term": null
    },
    {
        "name": "POLS 312 Urban Politics",
        "description": "Explores city life and all the elements that define it, the problems and prospects of the urban policy that surround, influence, constrain and color city life. When cross listed with Women's and Gender Studies, special attention is paid to the role of women as citizens and activists in the urban context. Offered occasionally.",
        "term": null
    },
    {
        "name": "POLS 317 Ecological Thought & Politics",
        "description": "This Service Learning course focuses on the writings of seminal figures in American ecological thought, such as John Muir, Gifford Pinchot, and Aldo Leopold. Examines the history and politics of land use and wilderness planning. Class will go on field trips in partnership with the United States Forest Service (USFS) and local environmental groups to learn first-hand about the politics of local land use. Offered occasionally.",
        "term": null
    },
    {
        "name": "POLS 319 American Foreign Policy",
        "description": "Evolution of American foreign policy, with emphasis on contemporary issues, national interests, interrelationship with domestic politics, and the decision-making process. Evaluation of Nationalist, Revisionist, and Realist views of foreign policy. How foreign policy may do justice. Spring.",
        "term": "S"
    },
    {
        "name": "POLS 321 Politics & Public Admin",
        "description": "The way American public bureaucracy operates. Fall and Spring.",
        "term": "FS"
    },
    {
        "name": "POLS 322 Gender, Sexuality, & Politics",
        "description": "Investigates the roles of gender and sexuality in American politics through examination of the wide array of goals, strategies, and tactics embraced by women and LGBTQ+ political movements as well as the agendas and actions of women and LGBTQ+ governmental actors. Special attention is paid to recognizing and understanding gender and sexuality-based distinctions in political participation, opinion formation, electoral success and representation. Spring semesters.",
        "term": "S"
    },
    {
        "name": "POLS 323 Constitutional Law:Inst Powers",
        "description": "A case-based examination of Supreme Court decisions treating the structure and distribution of power among government institutions. These decisions treat the powers of the national government (the legislative, executive, and judicial branches) and issues arising out of federalism: the powers of the states and the interplay between state and national institutions. Fall.",
        "term": "F"
    },
    {
        "name": "POLS 324 Grass Roots Politics",
        "description": "Examination of past town-meetings and recent theory and practice aimed at increasing direct use of political power by ordinary American citizens. Emphasis on the possibility of a new model of democratic government. Offered occasionally.",
        "term": null
    },
    {
        "name": "POLS 325 Selected Topics: Amer Politics",
        "description": "The study of selected topics in American politics.",
        "term": null
    },
    {
        "name": "POLS 326 Race & Ethnicity Politics",
        "description": "Examines the conditions facing selected racial and ethnic groups in the U.S., with African Americans being the primary case for analysis. Topics include the social construction of race and ethnicity, the wide range of political strategies and tactics employed by racial and ethnic groups in pursuit of equality, and U.S. immigration policy. Fall, even years.",
        "term": "FE"
    },
    {
        "name": "POLS 327 American Social Policy",
        "description": "Examines the origins, patterns, reforms, and criticisms of American social policy, the ties between knowledge and social policy; the impact of education, health care, and welfare policies on women, children, different racial and ethnic groups, and the middle class. Reviews normative claims for the proper role of the state and capitalism. Compares other western, capitalist societies and their policy regimes. Offered occasionally.",
        "term": null
    },
    {
        "name": "POLS 328 Politics of the Pacific NW",
        "description": "State and society in the Pacific Northwest: government, parties, reform movements, regionalism, and social forces in the U.S. Pacific Northwest, and British Columbia and Alberta. Regional issues such as taxation, health care, urbanization, land use, education, the environment, and resource-based economics are addressed in a comparative Canadian-U.S. context. Offered occasionally.",
        "term": null
    },
    {
        "name": "POLS 329 N Amer Environmental Policies",
        "description": "Study of local, regional, and international environmental policy, its challenges for not only administration and understanding, but also citizenship and accountability. Topics include water, ecosystem management and sustainability in the U.S., Canada and Mexico. Offered occasionally.",
        "term": null
    },
    {
        "name": "POLS 330 Ruling Well:Plato-Machiavelli",
        "description": "Great political theorists have criticized rulers and proposed alternative ways of ruling. In short, they have tried to change the world. This course examines the efforts of Plato, Aristotle, Augustine, Aquinas and Machiavelli to teach rulers how to do their job well. Fall, odd years.",
        "term": "FO"
    },
    {
        "name": "POLS 331 Modern Political Thought",
        "description": "The rise and development of British and French liberalism from the 17th through the 19th centuries. How freedom became the central issue in political thought, traced through consideration of Hobbes, Locke, Montesquieu, Rousseau, Paine, and Mill – plus a nod to Burke, a conservative critic of these developments. Consideration of the influence of liberalism on America. Spring.",
        "term": "S"
    },
    {
        "name": "POLS 332 Amer Polit Thgt: Founding Era",
        "description": "Political thought of the Puritan founders of Massachusetts. The American Revolution and the Constitution. Federalists and Anti-Federalists. Tocqueville's Democracy in America. Spring.",
        "term": "S"
    },
    {
        "name": "POLS 335 Marxism",
        "description": "Foundations of Marxism-Leninism. Major writings of Marx, Engels, and Lenin. Significance of Marxism in light of the apparent collapse of world communism. Marxism as a critique of American liberalism. Fall, even years.",
        "term": "FE"
    },
    {
        "name": "POLS 336 Selected Texts In PolThgt",
        "description": "Intensive look at a single writer or group of writers; designed to achieve greater understanding than is possible in a broad survey course. Offered occasionally.",
        "term": null
    },
    {
        "name": "POLS 338 20th-Century Political Thought",
        "description": "Treatment of 20th-century authors who examine the difficulties for democratic political life in contemporary mass society. Fall.",
        "term": "F"
    },
    {
        "name": "POLS 341 Feminist Political Thought",
        "description": "Analyzes several varieties of feminist theory to explore how conceptions of women, gender and feminism have changed and have structured women’s opportunities to participate fully in politics and the economy. Central questions include: the nature of sex/gender and sex/gender difference;\nwhat is feminism; who identifies as a feminist; and how gender identities are mediated by our class, race, and ethnic identities. Meets WGST Feminist Theory Requirement. Fall.",
        "term": "F"
    },
    {
        "name": "POLS 343 War and Peace",
        "description": "Analyzes several political philosophers' writings about war and peace, such as Kant's Perpetual Peace; also looks into recent case studies about establishing peace in various parts of the world. Offered occasionally.",
        "term": null
    },
    {
        "name": "POLS 346 Tocqueville and America",
        "description": "Close consideration of perhaps the greatest book on America politics and society. Tocqueville’s trip to America. His two volume work, Democracy in America. Tocqueville as a 19th century theorist of revolution. How far America today resembles Tocqueville’s description in the 1830s. What Tocqueville can teach us today about the link between political participation and freedom. Offered occasionally.",
        "term": null
    },
    {
        "name": "POLS 350 Survey of Internatnl Studies",
        "description": "Contemporary global issues and background information for all courses in International Studies. Studies the wisdom of the world's main civilizations, comparative economic systems and ideas, international politics, and the potential for international integration.",
        "term": null
    },
    {
        "name": "POLS 351 International Relations",
        "description": "Theory and practice of the international political system and the behavior of the participating nations. Taught only at Gonzaga-in-Florence.",
        "term": null
    },
    {
        "name": "POLS 352 Latin American Politics",
        "description": "Impressive contributions and drawbacks of the caudillo or leader in Latin American history, culture, and society, in the range of contemporary forms of government-democratic, dictatorial, revolutionary. Some treatment of U.S. foreign policy. Spring.",
        "term": "S"
    },
    {
        "name": "POLS 354 Comparative European Politics",
        "description": "Survey of the parties, institutions, political processes, issues and policies of the major western European industrialized nations. Special focus on England, France, and Germany, but coverage extends to the other European democracies as well. Fall, even years.",
        "term": "FE"
    },
    {
        "name": "POLS 355 Post-Soviet Russia and China",
        "description": "Focus on the pre-1985 Soviet political system; how Gorbachev's six-year reform program led to the unraveling of the Soviet Union; and the difficult transition to democracy and a market economy in post-Soviet Russia. Similarly, contrasts Maoist China with the uneasy mixture of economic reform and political repression coexisting in China today. Fall.",
        "term": "F"
    },
    {
        "name": "POLS 356 Area Studies in Politics",
        "description": "An analysis of selected foreign governments. Offered occasionally.",
        "term": null
    },
    {
        "name": "POLS 357 Italian Political System",
        "description": "Constitutional principles and governmental agencies in Italy today. Taught only at Gonzaga-in-Florence.",
        "term": null
    },
    {
        "name": "POLS 359 Global South Development",
        "description": "This course focuses on economic and political development in the Global South. The topics of the course include a survey of the eras of development, including colonial, Cold War, and post-colonial; conceptual approaches to economic and political development; 21st century challenges to sustaining development; and global frameworks for addressing development issues. A variety of country-based case studies will be utilized.",
        "term": null
    },
    {
        "name": "POLS 360 Parliamentary Government",
        "description": "Parliamentary or Cabinet government contrasted with the American government. Focus on disciplined parties, prime ministers, civil servants, and elected politicians, written and unwritten constitutional rules, parliamentary supremacy and rights-based politics. Usually features Canada but draws examples from Great Britain, New Zealand, India, and Australia. Spring, odd years.",
        "term": "SO"
    },
    {
        "name": "POLS 361 European Relations",
        "description": "Offered in Paris only.",
        "term": null
    },
    {
        "name": "POLS 363 Global Gender Regimes",
        "description": "Compares the lives of women around the world: their public and private roles and responsibilities, positions in government, the economy, and the private sphere. Seeks to explain women's status differences in various regions and societies by looking at the influence of culture, religion, economics, and politics. Spring, even years.",
        "term": "SE"
    },
    {
        "name": "POLS 364 Politics of the Pacific Rim",
        "description": "Focus on the role played by the East Asian capitalist development states (Japan, South Korea, Taiwan) in the accelerated economic growth of the Pacific Rim; a consideration of the Philippines or Indonesia as a representative of ASEAN; analysis of the Asian financial crisis and its impact on Hong Kong, USA, Russia, and China. Offered occasionally.",
        "term": null
    },
    {
        "name": "POLS 365 African Politics & Development",
        "description": "This is a course on the political economy of largely sub-Saharan Africa. Poverty is Africa’s overriding moral, economic, and political challenge. Topics include: state-society relations, civil society, institutions, incentives – political and economic, concepts and experiences of development, violence and ruling practices, trade and investment, urban and rural issues, formal and informal economies, social movements and political parties, inequality and justice, accountability of power, capacity building and corruption. Offered occasionally.",
        "term": null
    },
    {
        "name": "POLS 366 Perspectives on Global Issues",
        "description": "Critical analysis of vital global issues from the different perspectives of realists, idealists, and system-transformers. Exploration of competing worldviews and value systems, weighing of evidence from differing ideological, cultural, and gender perspectives. Introduces major analytical perspectives and organizing concepts fashioned by scholars to make these issues comprehensible. Offered occasionally.",
        "term": null
    },
    {
        "name": "POLS 367 New Europe",
        "description": "Studies the \"new Europe\" that has emerged since 1989 as integration through the European Union deepens and widens. Explores contemporary issues that European integration and globalization have fostered in the new Europe such as the resurgence of nationalism and extreme right-wing parties, the increased salience of local and regional identities, the need to build a supra-national European identity, increasing cultural diversity and the need to better manage immigration and migration, and Europe's place in the global economy and foreign affairs as it challenges American hegemony and seeks to continue to be a major player in world affairs. Fall, odd years.",
        "term": "FO"
    },
    {
        "name": "POLS 368 Tyranny to Democracy 21st C.",
        "description": "Between 1974 and 2000 more than fifty countries in Southern Europe, Latin America, East Asia, and Eastern Europe shifted from authoritarian to democratic systems of government. This course examines the causes and nature of these democratic transitions and investigates several case studies of democratic transitions in different areas of the world; in order to understand the factors responsible for the democratic trend and to ascertain which key variables best explain completed democratic transitions and democratic consolidation. Spring.",
        "term": "S"
    },
    {
        "name": "POLS 369 The Politics of Eurasia",
        "description": "We begin by developing our understanding of democracy and then proceed to explore the political, economic and social development of several countries of Central and Eastern Europe, Russia and Central Asia over time. What explains the various fates of the countries in this region? Political culture/history? Political agency? Proximity to \"the West\" and diffusion of norms? Spring, odd years.",
        "term": "SO"
    },
    {
        "name": "POLS 371 International Law",
        "description": "International law with an international relations focus. How and why international treaties and other sources of international law are created; actors who create, interpret, and enforce them. Structures for increasing compliance and their effectiveness. Variety of major international treaties and laws: war, sea, trade, and human rights. Spring, even years.",
        "term": "SE"
    },
    {
        "name": "POLS 372 Middle East Politics",
        "description": "Shows the Middle East is more than a region fraught with violence, ethnic hatred and the struggle for control of oil by examining the modern Middle East's history and context, a diverse set of country case studies, and current issues including the role of women, Islamic fundamentalism, terrorism, and peace in Israel-Palestine. Fall.",
        "term": "F"
    },
    {
        "name": "POLS 373 Arab-Israeli Conflict",
        "description": "Why is there an Arab-Israeli conflict? The question is much-discussed but not very often answered. Comprehensive effort to understand that question as well as the intense political debates surrounding it. Interdisciplinary, touching on the historical, political, and sociological origins and trajectory of the conflict. Spring.",
        "term": "S"
    },
    {
        "name": "POLS 376 International Organizations",
        "description": "Examines why intergovernmental organizations exist and whether they make a difference in solving global problems. Questions to be addressed include: Where does their power come from? Why are some designed differently than others? Why do countries use international organizations to achieve their goals? Are they effective? Practical knowledge about the major ones such as the U.N., the European Union, and the World Trade Organization. Their successes and failures about specific global problems such as conflict, human rights and development. Spring, odd years.",
        "term": "SO"
    },
    {
        "name": "POLS 377 International Treaties",
        "description": "Examines International Treaties: why they exist, origins of their power, different designs, uses made of them, effectiveness. Covers such examples as NATO, NAFTA, Kyoto Protocol. Their successes and failures about specific problems. Offered occasionally.",
        "term": null
    },
    {
        "name": "POLS 378 Climate Change Sci. & Politics",
        "description": "This course is an in-depth examination of climate change science and politics. It examines the science behind climate models, current and predicted environmental effects of a changing climate, policies, as well as the basic definitions and concepts citizens need to understand climate change and its related political issues. In the course we will examine how scientific and political thinking on climate change has evolved.",
        "term": null
    },
    {
        "name": "POLS 379 Model United Nations",
        "description": "Course repeatable for 9 credits. (only 6 credits can apply to POLS major)\nThis course is designed to enhance the student delegates’ achievement of the learning objectives through participation in simulations of various committees and other bodies of the United Nations. Through brief lectures, individual research and writing projects, in-class simulations, and participation in the National Model United Nations conference, students will gain an enhanced knowledge of global issues, a deeper understanding of what motivates state action, and an understanding of which factors facilitate or hinder cooperation. Students will also gain valuable writing, speaking, negotiating, and diplomatic skills. Enrollment by instructor permission only. Spring.",
        "term": "S"
    },
    {
        "name": "POLS 380 Special Topic - Int'l Relation",
        "description": "Political International Relations topics covered.",
        "term": null
    },
    {
        "name": "POLS 390 Directed Study",
        "description": "Topic to be determined by instructor.",
        "term": null
    },
    {
        "name": "POLS 395 Topics in Political Science",
        "description": "Selected questions in the discipline.",
        "term": null
    },
    {
        "name": "POLS 396 Service Learning Public Affair",
        "description": "Field work by arrangement with a community organization. Must be taken together with a designated service learning course. Requires a comprehensive internship report. Usually limited to Junior and Senior class students but, in special cases, first and second year students may be granted authorization by the Department Chair.",
        "term": null
    },
    {
        "name": "POLS 432 CIS:",
        "description": "The Core Integration Seminar (CIS) engages the Year Four Question: “Imagining the possible: What is our role in the world?” by offering students a culminating seminar experience in which students integrate the principles of Jesuit education, prior components of the Core, and their disciplinary expertise. Each section of the course will focus on a problem or issue raised by the contemporary world that encourages integration, collaboration, and problem solving. The topic for each section of the course will be proposed and developed by each faculty member in a way that clearly connects to the Jesuit Mission, to multiple disciplinary perspectives, and to our students’ future role in the world. Fall and Spring.",
        "term": "FS"
    },
    {
        "name": "POLS 484 Seminar in American Politics",
        "description": "Selected topics determined by Instructor.",
        "term": null
    },
    {
        "name": "POLS 486 Seminar in Political Thought",
        "description": "Selected topics determined by Instructor.",
        "term": null
    },
    {
        "name": "POLS 487 Sem in International Relations",
        "description": "Selected topics determined by Instructor.",
        "term": null
    },
    {
        "name": "POLS 488 Seminar: Comparative Politics",
        "description": "Selected topics determined by Instructor.",
        "term": null
    },
    {
        "name": "POLS 490 Directed Readings",
        "description": "Credit by arrangement for directed reading and reports on selected topics. Requires completion of a form, Department Chair permission, and cannot be registered for via ZAGWEB.",
        "term": null
    },
    {
        "name": "POLS 492 Indep Research or Study",
        "description": "Course repeatable for 9 credits.\nCredit by arrangement for research or study. Requires completion of a form, Department Chair permission, and cannot be registered for via Zagweb.",
        "term": null
    },
    {
        "name": "POLS 497 Political Science Internship",
        "description": "The Political Science Department grants academic credit for internships that enable students to learn practical lessons about politics.  Interns may work in a variety of governmental and non-governmental settings – possibilities include but are not limited to executive agencies, legislative staffs, campaign teams, and non-profit public interest groups.  A POLS professor must approve the internship and will ask for and review appropriate written work that the internship inspires.  Credit granted will vary with the hours demanded of the intern.  The amount of written work the intern does will also vary with the hours worked.",
        "term": null
    },
    {
        "name": "POLS 498 Senior Seminar",
        "description": "In this capstone course students integrate concepts and ideas from their coursework in political science subfields and apply knowledge of political science to one or more contemporary political issues. Topics covered in the class will vary by instructor.",
        "term": null
    }
]