[
    {
        "name": "RELI 101 Hebrew Bible",
        "description": "This course offers an introduction to the literature, religion, and social practices of the people of ancient Israel as it is reflected in the Hebrew Bible. Offered every year.",
        "term": null
    },
    {
        "name": "RELI 102 Old and New Testament",
        "description": "A study of both Old and New Testaments as the scriptures of Christianity. Offered occasionally.",
        "term": null
    },
    {
        "name": "RELI 103 New Testament",
        "description": "An exploration of the world and environment of the New Testament writers as well as Christianity's roots in the Jewish tradition. A basic introduction to the writings of the New Testament. Offered every other semester.",
        "term": null
    },
    {
        "name": "RELI 104 Narrating Jesus",
        "description": "This course introduces students to three different scholarly, interpretative methodologies for studying Jesus and the New Testament: historical criticism, narrative criticism, and application of the social sciences. Offered every other semester",
        "term": null
    },
    {
        "name": "RELI 107 Gospels: Life/Tch of Jesus",
        "description": "Who was Jesus? An academic study of Jesus as he is presented in the three synoptic gospels (Matthew, Mark, Luke) in the New Testament. Specific attention is given to the unique perspectives of each gospel, and to the ethical implications of Jesus’s life and teachings. Offered every year.",
        "term": null
    },
    {
        "name": "RELI 126 Intro to Christian Theology",
        "description": "An introduction to the academic discipline of Christrian theology and the way in which the Christian community makes believing possible and meaningful for contemporary people of faith. Offered every semester.",
        "term": null
    },
    {
        "name": "RELI 190 Directed Reading",
        "description": "Topic to be decided by faculty.",
        "term": null
    },
    {
        "name": "RELI 193 FYS:",
        "description": "The First-Year Seminar (FYS) introduces new Gonzaga students to the University, the Core Curriculum, and Gonzaga’s Jesuit mission and heritage. While the seminars will be taught by faculty with expertise in particular disciplines, topics will be addressed in a way that illustrates approaches and methods of different academic disciplines. The seminar format of the course highlights the participatory character of university life, emphasizing that learning is an active, collegial process.",
        "term": null
    },
    {
        "name": "RELI 202 Spirituality of Apostle Paul",
        "description": "Explore Paul's personal experience of faith in what he perceives as the cosmos altering significance of the life and death of Jesus of Nazareth on the one hand, and the practical implications of the Christ event for living transformed lives in the setting of communal fellowship, on the other. Offered every other semester.",
        "term": null
    },
    {
        "name": "RELI 203 Fem Interpret of Hebrew Bible",
        "description": "This course introduces students to the Hebrew Bible with special attention given to texts dealing with women. Offered occasionally.",
        "term": null
    },
    {
        "name": "RELI 206 Hebrew Bible-Ancient Near East",
        "description": "A comparative approach to human-human, human-divine, and divine-divine relationships in the Hebrew Bible and the ancient Near East, focusing on the human relational context and commitments towards social justice among warring cultures. Building intercultural competence, this course carries a global studies emphasis. Offered every year.",
        "term": null
    },
    {
        "name": "RELI 207 Messiah & Covenant",
        "description": "Examine the controversial issues “messiah” and “covenant” in the biblical text as well as its appropriations and distortions within the Christian and Catholic traditions. Students will better understand competing perspectives in the Old and New Testaments, the multivalent nature of the biblical text historically, culturally, and theologically, and modern critical comparative methods for applying the text and thinking theologically. Offered every year.",
        "term": null
    },
    {
        "name": "RELI 220 Catholicism",
        "description": "Exploration of the identity of the Roman Catholic tradition with emphasis on Catholicism's dialogue with the contemporary world.",
        "term": null
    },
    {
        "name": "RELI 226 Challenges in Catholic Theol",
        "description": "This course aims to explore the teachings and debates around several classical and perennial themes in Christian theology around which significant dialogue and debate exist today. Offered every year.",
        "term": null
    },
    {
        "name": "RELI 227 Theology in Global Contexts",
        "description": "A course in Christian and Catholic traditions with a Global Studies designation (GS), which investigates opportunities and challenges posed by religious and cultural diversity in our world today. Topics include Theologies of Religion, Culture, World Christianity, and Catholic Social Teaching. Offered most summers.",
        "term": null
    },
    {
        "name": "RELI 228 Catholicism",
        "description": "Exploration of the identity of the Roman Catholic tradition with emphasis on Catholicism's dialogue with the contemporary world. Offered every semester.",
        "term": null
    },
    {
        "name": "RELI 229 Christian Diversity",
        "description": "An introduction to the history, beliefs, and practices of a wide variety of denominations within Christianity such as Orthodox, Lutheran, Anglican, Reform, Anabaptist, and others. Students will also explore the impact of culturally diverse expressions of Christianity. Offered every semester.",
        "term": null
    },
    {
        "name": "RELI 230 Contemporary Church",
        "description": "A theological and historical examination of the contemporary church from the perspective of the Second Vatican Council.",
        "term": null
    },
    {
        "name": "RELI 232 Global Christologies",
        "description": "Examine how Christian theological interpretations of the significance of the person of Jesus of Nazareth are shaped by the context in which church communities live. After examining Christological method, the biblical witness to Jesus, and early Christological doctrines, the course moves continent by continent to examine different contextual Christologies and the ways they call the Christian community to social transformation toward the reign of God. Offered every other semester.",
        "term": null
    },
    {
        "name": "RELI 233 Christian Spirituality",
        "description": "The sources, nature, and forms of Christian spirituality historically and within the contemporary context. Offered every semester.",
        "term": null
    },
    {
        "name": "RELI 234 Feminism and Christianity",
        "description": "An introduction to the academic discipline of Christian theology, and the way in which the Christian community makes believing possible and meaningful for contemporary people of faith. Particular attention is given to the impact of feminist scholarship on the doing of Christian theology. Offered every other semester.",
        "term": null
    },
    {
        "name": "RELI 235 Christian Mysticism",
        "description": "Explore the history, theology and practice of Christian mysticism from the early Church to the present day. Students are guided by the curriculum of the contemplative master, Thomas Merton, who situates the discipline of mysticism in the center of Christian life, and in relation to tradition, doctrine, worship, spiritual experience and ethical action. Offered every semester.",
        "term": null
    },
    {
        "name": "RELI 236 God and Evil",
        "description": "Explore the problem of God and the experience of evil from within the Christian theological tradition. Our exploration includes an examination of theological texts, poetry, film and the visual arts. Offered every other year.",
        "term": null
    },
    {
        "name": "RELI 240 Seminar: Special Topics",
        "description": "Topic to be determined by instructor.",
        "term": null
    },
    {
        "name": "RELI 248 Christian Nonviolence",
        "description": "The choice of violence or nonviolence as methods of social change to create a more just society is one of the central issues in Christian ethics. Global events have refocused attention on methods of social change necessitating decisions regarding violence and nonviolence. Martin Luther King faced this choice. Based on his understanding of Christianity, he chose the way of nonviolence. Beginning with scriptural readings and following an historical overview of nonviolence within the Christian tradition, this course then moves to an in-depth analysis of King’s nonviolent ethic, its religious and theological foundations, his reasons for rejecting violence, and his vision of justice. We will examine King’s religious beliefs, sources, presuppositions, and goals of his understanding of nonviolence as we seek to determine whether nonviolence can achieve a more just society. Although King frames his belief in nonviolence with a Christian context, the course will also show the influence of Mohandas Gandhi on King’s development of nonviolence. Fundamentally both King and Gandhi, and thinking about nonviolence, refer us to the Year 2 theme of the Core, Being and Becoming: Who are we and what does it mean to be human?",
        "term": null
    },
    {
        "name": "RELI 252 African American Religions",
        "description": "Introduces students to the variety of African American religions that developed in the Americas during and after the Atlantic slave trade up to today. Within various forms of Christianity, Islam, and even Hip Hop, we will examine the interplay between religion, race, colonialism, and self determination. Offered every other semester.",
        "term": null
    },
    {
        "name": "RELI 253 Islamic Civilization",
        "description": "Introduction to the history of Islamic civilization centering on the relationship of religion to society and culture; the origins of Islam; Islamic belief and practice; Islam, politics, and society; fine arts and intellectual developments; and Islam in the modern world. Offered every semester.",
        "term": null
    },
    {
        "name": "RELI 254 American Christianities",
        "description": "A thematic and chronological framework for understanding the diversity of Christianities in American history and culture. We investigate the powerful social, cultural, political, and intellectual role Christianity has played throughout our nation's past. Offered every other semester.",
        "term": null
    },
    {
        "name": "RELI 255 Relig of the African Diaspora",
        "description": "This course introduces students to a variety of religions in the African diaspora. As such, the course focuses on theoretical understandings of diaspora, Africa, the Caribbean, and the United States. Diaspora forces a unique approach to the study of religion, as communities in diaspora prompt questions about identity, multivocality, ritual, home, story, and space. Offered every year.",
        "term": null
    },
    {
        "name": "RELI 256 African Religious Traditions",
        "description": "Introduction to various forms of religiosity in sub-Saharan Africa. Through the study of religion, this class prompts students to better understand various aspects of African cultures by dismantling stereotypes and assumptions that have long characterized the study of religions in Africa. Offered every semester.",
        "term": null
    },
    {
        "name": "RELI 257 Critics of Christianity",
        "description": "What can we learn about Christianity from its critics? Examine people (such as, Jesus, Voltaire, Victor Hugo, Nietzsche, Freud, Malcolm X, Martin Luther King, Jr., Stephen Colbert) and the Church’s treatment of groups (Jews, Latin Americans, women, LGBTQ persons) in order to understand the critiques of those within and outside the Church. Offered every year.",
        "term": null
    },
    {
        "name": "RELI 258 Christian-Muslim Relations",
        "description": "A historical, topical, and socio-cultural survey of Christian-Muslim relations from the 7th century (CE) to today. Our exploration will revolve around on a series of diverse case studies on different dynamics of this encounter, to include key historical episodes, literary productions, theological discourses, and modern challenges and opportunities. Offered every year.",
        "term": null
    },
    {
        "name": "RELI 259 Religions of Asia",
        "description": "This survey course introduces the following Asian religions: Hinduism, Buddhism, Confucianism, Daoism, and Shinto. We examine the teachings of these Asian traditions in the context of their diverse cultural and historical settings. We also consider how these Asian religions have adapted to fit the contemporary world and how they have influenced popular culture. Offered every semester.",
        "term": null
    },
    {
        "name": "RELI 261 Hist and Tchg of Christianity",
        "description": "Designed to give students of Christian and non-Christian backgrounds an introductory knowledge of the growth and development of Christianity from its beginnings to the present day. Offered every year.",
        "term": null
    },
    {
        "name": "RELI 263 Hinduism",
        "description": "Introduction to the foundations and milestones of Hinduism and the importance of Hindu mythology in shaping Indian culture and rituals. Offered infrequently.",
        "term": null
    },
    {
        "name": "RELI 264 Buddhism",
        "description": "Introduction to Buddhism examines the historical and cultural contexts in which Buddhist beliefs and practices were developed in Asia and how they spread to the West. We also study how, throughout history, Buddhism has adapted to a changing world. Offered every other semester.",
        "term": null
    },
    {
        "name": "RELI 267 Early Christianity",
        "description": "Focus on the rise of Christianity in the religious pluralism of late antiquity, and the way in which the early Christians, as citizens of a non-Christian culture, defined themselves, the church and their place in society. Examine the philosophical, social and religious context in the Roman empire, and central theological and institutional developments in the church from its origin to the fourth century. Offered every year.",
        "term": null
    },
    {
        "name": "RELI 268 Judaism",
        "description": "Explore Judaism as a living religion and a diverse religio-cultural phenomenon. Topics include Judaism’s history and a survey of contemporary Jewish religious practices. Offered every other year.",
        "term": null
    },
    {
        "name": "RELI 276 Principles of Christian Ethics",
        "description": "How are Christians to fashion moral choices, character, and communities? What are the sources, tools, and rules of Christian ethics? What kind of justice does the Christian faith demand? Offered every semester.",
        "term": null
    },
    {
        "name": "RELI 277 Bible and Ethics",
        "description": "Biblical texts address multiple moral and ethical issues, often framing such issues as questions of justice or injustice. This class explores four contemporary ethical issues by placing personal narratives/experiences into mutually critical dialogue with biblical texts. Offered every year.",
        "term": null
    },
    {
        "name": "RELI 286 Special Topics: Texts Theology",
        "description": "Selected topics in Religious Studies in the areas of either Sacred Texts and Traditions or Spirituality and Theology. Topic to be determined by instructor.",
        "term": null
    },
    {
        "name": "RELI 287 Special Topics: Culture Ethics",
        "description": "Selected topics in Religious Studies in the areas of either Religion, Culture, and Society or Ethics. Topic to be determined by instructor.",
        "term": null
    },
    {
        "name": "RELI 290 Directed Study",
        "description": "Topic to be determined by faculty.",
        "term": null
    },
    {
        "name": "RELI 301 Stories of the Quran",
        "description": "A literary, historical, and socio-cultural introduction to the Quran and its exegesis through the stories of the prophets. Overall explore how stories and storytelling can help us ask fundamental questions, not only about Islam but also about the human experience broadly. Offered every other year.",
        "term": null
    },
    {
        "name": "RELI 302 Bible and Film",
        "description": "Explore different ways in which religion (and theology) and film can be placed into mutually critical conversation. Specific attention given to constructing mutually enriching dialogues between recent films (1999-present) and specific biblical texts. How can biblical texts provide new lenses for the viewing of films? In what ways can films enrich the understanding and interpretation of biblical texts? Offered every semester.",
        "term": null
    },
    {
        "name": "RELI 326 Liturgy",
        "description": "A detailed survey of Christian and Catholic liturgy, including the roots and contemporary manifestations of celebration, ritual, and symbol. Offered every year.",
        "term": null
    },
    {
        "name": "RELI 328 Women in Jewish Traditions",
        "description": "This course examines the role of women in the sacred texts of the Jewish tradition. Particular attention is given to the legal status of women, complex issues of identity, tradition, and family, and the geographic diversity of Judaism in history and today. Offered every other semester.",
        "term": null
    },
    {
        "name": "RELI 329 Theological Anthropology",
        "description": "This course explores classical, modern, and contemporary theological voices that address the shifting conceptions of human personhood, the nature of religious experience, and the tasks and ends of Christian living. Particular attention is given to the themes of creation in the image of God, human freedom, original sin and divine grace, redemption and liberation, Christian community, and the changing perspectives on Christian anthropology in contemporary thought. Offered every other year.",
        "term": null
    },
    {
        "name": "RELI 333 Political Theology",
        "description": "An inquiry into the political shifts in religious faith and practice in the wake of globalization and modern secularism. Students explore critiques of classic accounts of divine transcendence and religious authority, the growing recognition of the plight of the poor and marginalized, and the increasingly political focus of contemporary theologians and religious thinkers in response to this rapidly shifting intellectual milieu. Offered every year.",
        "term": null
    },
    {
        "name": "RELI 334 Interreligious Dialogue",
        "description": "Investigate the imperative of Christianity and other world religions to engage in respectful dialogue and mutual understanding, expose pressing practical issues such as religious violence and divisive ideologies, and propose a comparative theological perspective highlighting spiritual engagement, moral responsibility and reconciliation. Offered every semester.",
        "term": null
    },
    {
        "name": "RELI 335 Faith, Justice, and The Church",
        "description": "What does the Christian faith have to say about our economic, political, social, and cultural structures and practices? An examination of the ways the Church calls people to practice a ‘faith that does justice.’",
        "term": null
    },
    {
        "name": "RELI 338 Discernment & Faith Traditions",
        "description": "An exploration of the ways people make important decisions based on their belief and practice in a particular religious/cultural setting. The course is built on the foundation of a theological view of the sacred relationship between human beings and the divine/wisdom figures who support and challenge humans to be the best version of themselves by making sound, responsible, and moral choices. Offered every year.",
        "term": null
    },
    {
        "name": "RELI 339 Ignatian Spirituality",
        "description": "This course is designed to introduce students of Christian and non-Christian backgrounds to Ignatian Spirituality. The major part of the course will study the dynamics of the Spiritual Exercises of Saint Ignatius by exploring the Ignatian themes of spiritual discernment, contemplation in action, and finding God in all things. Offered every semester.",
        "term": null
    },
    {
        "name": "RELI 340 Feminist Theologies",
        "description": "Examines the tasks of feminist theologians and surveys the challenges and unique contributions they make to the integrity and vitality of contemporary Christianity. Offered every other year.",
        "term": null
    },
    {
        "name": "RELI 341 Christian Morality and Eating",
        "description": "Why biblical and Christian morality demands just and sustainable agricultural systems that feed the hungry, compensate and protect workers, and treat animals humanely. Offered every year.",
        "term": null
    },
    {
        "name": "RELI 342 Trinity",
        "description": "An introduction to the theology of the Trinity in its historical developments and contemporary interpretations, this course examines the content and method of Christian theology by focusing on the doctrine of the Trinity. Offered every year.",
        "term": null
    },
    {
        "name": "RELI 354 Islamic Civilization",
        "description": "Introduction to the history of Islamic civilization centering on the relationship of religion to\nsociety and culture; the origins of Islam; Islamic belief and practice; Islam, politics, and society;\nfine arts and intellectual developments; and Islam in the modern world.",
        "term": null
    },
    {
        "name": "RELI 355 Islam in the Contemp World",
        "description": "Examine contemporary interpretations and expressions of the Islamic tradition, focusing on the time period following 19th century colonialism and through the present day. After a brief introduction to the origins of the Islamic tradition (and its main figures), we examine how Muslims have responded to the political, social, and economic changes they encountered through European colonialism, and the realities they face in the postcolonial period. Offered every year.",
        "term": null
    },
    {
        "name": "RELI 356 Native American Religions",
        "description": "This course examines traditional Native cultures and contributions along with the cultural stereotypes that distort their reality. Includes the role of Christian missions in forming contemporary Native realities and studies the revitalization movements among North American tribes.",
        "term": null
    },
    {
        "name": "RELI 357 Sufism: Islamic Mysticism",
        "description": "A historical and topical introduction of the world of Sufism, the mystical tradition of Islam. Some of the subjects we explore include the relationship of Sufism to “normative” Islam, social and ethical dimensions, ritual and performance (music, dance, poetry), and the challenges of modernity. Offered every other year.",
        "term": null
    },
    {
        "name": "RELI 358 Faith in a Secular Age",
        "description": "An inquiry into the shifting place of religious faith and practice in the face of modern secularism and post-secularism. Throughout the course, students are introduced to various responses of Christian and Catholic thinkers to the exciting challenges of the rapidly shifting discussion of the place of faith and religious practice in the contemporary world. Offered every other year.",
        "term": null
    },
    {
        "name": "RELI 359 Religion and Globalization",
        "description": "This course explores the impact of global networks of capitalism, communication, and transportation on religious ideas, practices, and transformations in the contemporary world. Offered every year.",
        "term": null
    },
    {
        "name": "RELI 363 Buddhist Meditation & Practice",
        "description": "A combination of the history of Buddhism and secularized contemplation activities. The course offers a history of Buddhist meditation along with an investigation of how contemporary Buddhist followers adapt Buddhist principles and meditation techniques to tackle issues related to emotional well-being, hospice care, therapy, and social justice. Offered every semester.",
        "term": null
    },
    {
        "name": "RELI 364 Asian Religions in Film",
        "description": "Explore Asian religions in contemporary Asian, European, and North American cultures through film. By focusing on how Asian religious themes are treated in each film, we learn to identify longstanding Asian religious themes in contemporary films. We also investigate how Asian religions are employed in films to address contemporary issues. Offered every year.",
        "term": null
    },
    {
        "name": "RELI 365 Religion and Film",
        "description": "This course explores different ways in which religion (and theology) and film can be placed into mutually critical conversation of central concern are the diverse responses by theologians (Jewish and Christian) and films to trauma such as the Holocaust. Offered every year.",
        "term": null
    },
    {
        "name": "RELI 366 Religion and Violence",
        "description": "In today's world of alarming growth in sectarianism, radicalization, and terrorism across many continents, does religion simply give rise to human division or, is it- as some say - peaceful? This course not merely studies religious violence, it responds to it and encourages Gonzaga students to think with and beyond a variety of disciplines to develop their own skills of interpretation. Offered every year.",
        "term": null
    },
    {
        "name": "RELI 371 Afri Reli&Migration in CathEU",
        "description": "In the wake of Europe—the historic and dominant home of Catholicism—recently becoming a destination for many West African migrants, who populate and impact the religious landscape, an essential work of the church and society is understanding the trending phenomenon. This course will deconstruct and analyze the various manifestations of interactions, common grounds, parallels, and similarities (more than the differences) embodied by African religions and Catholicism in ways that enable human flourishing. We will use multidisciplinary resources, including immigration and ethnography—to explore a range of questions that animate these vibrant religious landscape: What happens when African religions encounter Catholicism at its epicenter? Specifically, what happens when the world's two fastest-growing Christian faiths (African Pentecostalism and Catholicism) come into contact, share worship space, and use identical sacramental objects and images in an intriguing contact zone? Many of our questions will also arise organically as students explore their standing in a pluralized world in light of assigned class readings.",
        "term": null
    },
    {
        "name": "RELI 376 Christian Sexual Ethics",
        "description": "Explore Christian perspectives on the ethical dimensions of human sexuality and issues of gender. Offered every semester.",
        "term": null
    },
    {
        "name": "RELI 377 Ethics-Human Rgts-Globalizatn",
        "description": "Focus on religious and ethical responses to issues arising in relation to globalization, and specifically, the topic of human rights.",
        "term": null
    },
    {
        "name": "RELI 386 Special Topics: Texts Theology",
        "description": "Selected topics in Religious Studies in the areas of either Sacred Texts and Traditions or Spirituality and Theology. Topic to be determined by instructor.",
        "term": null
    },
    {
        "name": "RELI 387 Special Topics: Culture Ethics",
        "description": "Selected topics in Religious Studies in the areas of either Religion, Culture, and Society or Ethics. Topic to be determined by instructor.",
        "term": null
    },
    {
        "name": "RELI 391 Directed Study",
        "description": "Topic to be decided by faculty.",
        "term": null
    },
    {
        "name": "RELI 399 Methodology",
        "description": "As preparation for the senior thesis, and for the advanced study of religion and theology, this course will review the various critical-methodological approaches used in the discipline. In addition to entering the academic conversation, students learn techniques for accessing, evaluating, and presenting research. Offered in the Fall.",
        "term": "F"
    },
    {
        "name": "RELI 413 The Gospel of John",
        "description": "This upper-level Sacred texts course provides students with a detailed reading of the Gospel of John with attention given to the theological, literary, historical, and sociological aspects of the Fourth Gospel. Special attention will be given both to the role of symbolism in the Fourth Gospel, and the way the Gospel employs narrative to give expression to its unique witness to the story of the life, death, and resurrection of Jesus.",
        "term": null
    },
    {
        "name": "RELI 432 CIS:",
        "description": "The Core Integration Seminar (CIS) engages the Year Four Question: “Imagining the possible: What is our role in the world?” by offering students a culminating seminar experience in which students integrate the principles of Jesuit education, prior components of the Core, and their disciplinary expertise. Each section of the course will focus on a problem or issue raised by the contemporary world that encourages integration, collaboration, and problem solving. The topic for each section of the course will be proposed and developed by each faculty member in a way that clearly connects to the Jesuit Mission, to multiple disciplinary perspectives, and to our students’ future role in the world.",
        "term": null
    },
    {
        "name": "RELI 467 Early Christian Sex & Gender",
        "description": "This course examines early Christian thought and practice around sex, gender, and sexuality in the context of the wider ancient Roman world. We will read New Testament texts, saints’ lives, martyr acts, medical manuals, and homilies, as well as encountering artifacts and material culture. We will also intersperse readings in contemporary theories of gender, sexuality, and religion.",
        "term": null
    },
    {
        "name": "RELI 486 Special Topics: Texts Theology",
        "description": "Selected topics in Religious Studies in the areas of either Sacred Texts and Traditions or Spirituality and Theology. Topic to be determined by instructor.",
        "term": null
    },
    {
        "name": "RELI 487 Special Topics: Culture Ethics",
        "description": "Seminar-format, upper-division selected topics in Religious Studies in the areas of either Religion, Culture, and Society or Ethics. Topic to be determined by instructor.",
        "term": null
    },
    {
        "name": "RELI 490 Directed Readings",
        "description": "Topic to be determined by faculty.",
        "term": null
    },
    {
        "name": "RELI 493 Sociology of Religion",
        "description": "Study of works of classical and contemporary sociologists on the social and cultural aspects of religion. Examine how religion is influenced by social conditions and often plays an important role in shaping society.",
        "term": null
    },
    {
        "name": "RELI 497 Internship",
        "description": "In this course, students will work together with a faculty member to engage in sustained reflection on field-based experience in an internship.",
        "term": null
    },
    {
        "name": "RELI 499 Senior Thesis",
        "description": "In this course, students will write an original thesis in Religious Studies or Theology that brings together research, new insights, and application of research methodologies in the field.",
        "term": null
    }
]