[
    {
        "name": "WGST 100 Introduction to WGST",
        "description": "This course introduces students to key concepts and foundational research that shapes the interdisciplinary study of women, gender, and sexuality in the contemporary moment. Students will use an intersectional lens to explore the social construction of gender and sexuality, hegemonic gender norms, and feminist movements.",
        "term": null
    },
    {
        "name": "WGST 193 FYS:",
        "description": "The First-Year Seminar (FYS) introduces new Gonzaga students to the University, the Core Curriculum, and Gonzaga’s Jesuit mission and heritage. While the seminars will be taught by faculty with expertise in particular disciplines, topics will be addressed in a way that illustrates approaches and methods of different academic disciplines. The seminar format of the course highlights the participatory character of university life, emphasizing that learning is an active, collegial process.",
        "term": null
    },
    {
        "name": "WGST 200 Gender, Difference & Power",
        "description": "In this course students will learn about how feminist interdisciplinary scholars study the construction and practice of gender in various contexts, with an emphasis on the intersections of gender, race, class, sexuality, nation, and disability. Students will deepen their knowledge of basic women, gender, and sexuality studies concepts and theories, and issues of interest in relation to family life, work, sexuality, health, militarism, immigration, globalization, the environment, and social change.",
        "term": null
    },
    {
        "name": "WGST 205 Gender and Pop Culture",
        "description": "In the digital media age popular culture saturates many aspects of everyday life. This course is a critical examination of the ways popular culture generates and shapes images of gender, race/-ethnicity, class, and sexuality. In order to understand how popular cultural shapes understandings of and attitudes towards gender, the course will pay special attention to the ways femininity and masculinity are represented and contested in multiple forms of commercial media and independent popular culture including music, film, television, print media, video games, news, sports, social media, and various \"objects\" of material culture, such as food, toys, and clothing. The course uses cultural studies methods to examine the production, meanings, and social uses of popular culture by multiple communities in local and global contexts.",
        "term": null
    },
    {
        "name": "WGST 219 Introduction to Literature",
        "description": "This course introduces student to literacy study through the exploration of gender in the major genres of literature (poetry, fiction, and drama).",
        "term": null
    },
    {
        "name": "WGST 220 Studies in Literature & Gender",
        "description": "This course examines gender issues in various literary texts. Course may focus on only one genre or may include several genres.",
        "term": null
    },
    {
        "name": "WGST 222 Multicultural Literature",
        "description": "This course introduces students to the diverse nature of multicultural literature while helping them develop increasingly complex understandings of the continually evolving issues connected to national and international discourses on race and ethnicity, as well as gender and sexuality. We explore the ways in which literature contributes to the definition and redefinition of individual and collective identities from multiple perspectives.",
        "term": null
    },
    {
        "name": "WGST 251 Fem Interpr of Hebrew Bible",
        "description": "This course introduces students to the Hebrew Bible with special attention given to texts dealing with women.",
        "term": null
    },
    {
        "name": "WGST 252 Feminism and Christianity",
        "description": "An introduction to the academic discipline of Christian theology, and the way in which the Christian community makes believing possible and meaningful for contemporary people of faith. Particular attention is given to the impact of feminist scholarship on the doing of Christian theology. Offered every other semester.",
        "term": null
    },
    {
        "name": "WGST 255 Women in Catholicism",
        "description": "The focus of this course is to examine the identity and mission of the church as an institution and a community of faith emerging from Vatican Council II. Feminist theology will provide the lens for examining the role of women in the church in both historical and contemporary situations.",
        "term": null
    },
    {
        "name": "WGST 260 Sex, Gender, and Society",
        "description": "This course is an introduction to the sociological study of gender. From the moment of birth (and sometimes even before birth) gender shapes how people are treated. Gender structures the experiences of people in all major social institutions, including the family, the workplace, and schools. Yet gender is so taken for granted as a basis for differences among people that it can be difficult to see the underlying social structures and cultural forces that reinforce or weaken the social boundaries that define gender. A sociological view of gender emphasizes how gender is socially constructed and how structural constraints limit choice. Thus, this course examines how differences based on gender are created and sustained; gendered experiences on campus and at work; and the relationship between gender, power, and social inequality. We will pay particular attention to how other important bases of personal identity and social inequality—race and class—interact with patterns of gender relations.",
        "term": null
    },
    {
        "name": "WGST 261 Sociology of Health & Medicine",
        "description": "This course examines the social context of health, illness and health care. Particular attention will be paid to the effects of culture and social inequality on health, the interaction of various health care professionals, and political debates about the health care system.",
        "term": null
    },
    {
        "name": "WGST 280 Special Topics",
        "description": "Topic to be determined by faculty.",
        "term": null
    },
    {
        "name": "WGST 300 Feminism and Intersectionality",
        "description": "In this course students will learn about how the feminist framework of intersectionality is employed within the fields of Women, Gender, and Sexuality Studies to study a wide range of issues in the context of US imperialism. Specifically, students will study the interlocking nature of systems of\noppression, including by not limited to racism, classism, and sexism, by applying intersectionality to the study of identities, institutions, and ideologies from a transnational feminist perspective. \nPre-requisites: ANY 100 or 200 level WGST course, or by instructor permission.",
        "term": null
    },
    {
        "name": "WGST 304 Feminism and Science",
        "description": "This course is an introduction to the interdisciplinary field of Feminist Science and Technology Studies. Students will learn what the field of FSTS has to say about various social justice issues, such as equity for women in science, the history of the science of human difference, how human values shape science in action for better or worse, and what feminism has to offer the scientific endeavor The course will explore a series of interrelated questions: How do scientific understandings of human difference (gender, race, sexuality, etc.) shape who participates in science, historically and in the present moment? What is the relationship between politics, culture, and science? What are some of the experiences of women and other minoritized people in science fields? How have the sciences been used to perpetuate injustice (war, environment, unethical human subjects, research)? Can the sciences be used to advance social Justice? How can feminism shape the culture and practice of science? And, what do the sciences have to offer feminist thought?",
        "term": null
    },
    {
        "name": "WGST 305 Transnational Feminisms",
        "description": "This course explores key feminist debates from a global perspective focusing on collaborations and activist efforts across geographical and cultural borders. We will examine how those collaborations work to eradicate a variety of social inequalities targeting women and other historically marginalized groups. Among the issues to be discussed are reproductive rights, feminicides, sex trafficking, armed conflicts, and environmental protection.",
        "term": null
    },
    {
        "name": "WGST 327 Shakespeare",
        "description": "Selected plays and poetry.",
        "term": null
    },
    {
        "name": "WGST 330 Women in U.S. History",
        "description": "This course explores the history of American women from the colonial era to the present using a women and gender studies framework. The class investigates gender roles and the ways that race, class, politics, national origin, colonization, and the passage of time alter those expectations. This seminar style course investigates women’s economic and political lives and social contributions through suffrage, reform, civil rights, feminism, and more.",
        "term": null
    },
    {
        "name": "WGST 331 Women in Colonial Latin Amer",
        "description": "This course will investigate the lives of women in both the pre-contact and post-conquest societies. The first part of the course concentrates on the activities of women, and their role in society, among the Aztecs, Inca, and Pueblo civilizations. The course will follow with the study of their experiences after the Spanish Conquest. The final section of the course will cover the variety of women, ranging from wealthy Spanish women, established nuns, marginal mystics, Indian leaders, and African women, and their experiences in the Spanish colonies. Students will learn about and discuss the various gender systems which operated in different periods, and how these systems shaped women's lives as women shaped the systems themselves.",
        "term": null
    },
    {
        "name": "WGST 340 Gender, Sexuality, & Politics",
        "description": "Investigates the roles of gender and sexuality in American politics through examination of the wide array of goals, strategies, and tactics embraced by women and LGBTQ+ political movements as well as the agendas and actions of women and LGBTQ+ governmental actors. Special attention is paid to recognizing and understanding gender and sexuality-based distinctions in political participation, opinion formation, electoral success and representation.\nSpring semesters.",
        "term": "S"
    },
    {
        "name": "WGST 342 Global Gender Regimes",
        "description": "Compares the lives of women around the world; their public and private roles and responsibilities, positions in government, the economy, and the private sphere. This course seeks to explain women's status differences in various regions and societies by looking at the influence of culture, religion, economics, and politics.",
        "term": null
    },
    {
        "name": "WGST 343 Constitutn Law,Civl Libty,Rgts",
        "description": "A case-based examination of Supreme Court decisions treating aspects of the Bill of Rights and the Fourteenth Amendment. These decisions cover topics such as freedom of speech, freedom of press, religious freedoms, the right to privacy, and questions of discrimination in its many forms including racial, sexual, and voting rights.",
        "term": null
    },
    {
        "name": "WGST 344 American Social Policy",
        "description": "This course examines the origins, patterns, reforms, and criticisms of American social policy. Consideration of ties between knowledge and social policy, and the particular impact of education, health care, and welfare policies on women, children, different racial and ethnic groups, and the middle class. A review of normative claims for the proper role of the state and capitalism, as well as comparisons with other western, capitalist societies and their policy regimes. Upon sufficient demand.",
        "term": null
    },
    {
        "name": "WGST 350 Women Artists",
        "description": "An introduction to women as creators of fine and decorative art within North America and Europe from the late 18th C. to today. The course also addresses how women have been represented in art by men and other women.",
        "term": null
    },
    {
        "name": "WGST 352 Psychology of Gender",
        "description": "A review of both the theory and empirical literature investigating the psychology of gender (including biological cognitive, developmental, and psychosocial models).",
        "term": null
    },
    {
        "name": "WGST 353 Christian Sexual Ethics",
        "description": "Explore Christian perspectives on the ethical dimensions of human sexuality and issues of gender. Offered every semester.",
        "term": null
    },
    {
        "name": "WGST 354 Women in the Jewish Tradition",
        "description": "This course examines the role of women in the sacred texts of the Jewish tradition. Particular attention is given to the legal status of women, complex issues of identity, tradition, and family, and the geographic diversity of Judaism in history and today. Offered every other semester.",
        "term": null
    },
    {
        "name": "WGST 360 Sociology of Family",
        "description": "Examines images and practices of family life in American society.  Uses historical material to show how ideals about family life have developed. Discusses definitions of \"family\" as political, with a special emphasis on the politics of gender. Connects debates over how to define and understand family with decisions about social policies.",
        "term": null
    },
    {
        "name": "WGST 380 Special Topics",
        "description": "Topic to be determined by instructor.",
        "term": null
    },
    {
        "name": "WGST 390 Independent Study",
        "description": "Supervised reading in one of the previously mentioned areas of study, not to replace existing courses but to provide an opportunity for advanced study not available within the regular curriculum. Directed reading requires completion of a form, WGST Department Chair permission, and cannot be registered for via Zagweb.",
        "term": null
    },
    {
        "name": "WGST 401 Feminist Political Thought",
        "description": "Analyzes several varieties of feminist theory to explore how conceptions of women, gender and feminism have changed and have structured women’s opportunities to participate fully in politics and the economy. Central questions include: the nature of sex/gender and sex/gender difference;\nwhat is feminism; who identifies as a feminist; and how gender identities are mediated by our class, race, and ethnic identities. Meets WGST Feminist Theory Requirement. Fall.",
        "term": "F",
        "prerequisites": {
            "type": "or",
            "requirements": [
                {
                    "course": "WGST 200 Minimum Grade: D"
                },
                {
                    "course": "WGST 300 Minimum Grade: D"
                }
            ]
        }
    },
    {
        "name": "WGST 402 Feminist Genealogies",
        "description": "This course focuses on feminist and queer theories produced by and centered on historically marginalized communities by gender, race, sexuality, class, ability, citizenship, and location categories. The theories are purposely selected to explore genealogical analyses of power, transnational activism, and decolonial knowledge, among other themes. An overview of the development and foundational approaches to feminist and queer theorizing explored in this course allows students to apply these theories to contemporary issues and experiences. Pre-requisites: WGST 200 OR WGST 300",
        "term": null,
        "prerequisites": {
            "type": "or",
            "requirements": [
                {
                    "course": "WGST 200 Minimum Grade: D"
                },
                {
                    "course": "WGST 300 Minimum Grade: D"
                }
            ]
        }
    },
    {
        "name": "WGST 403 Crit Theory:Lit & Cltrl Stdy",
        "description": "This course examines various theories for interpreting literature and culture.",
        "term": null
    },
    {
        "name": "WGST 417 Tudor & Stuart Drama",
        "description": "Focuses on the varied dramatic traditions of Tudor and Stuart London besides Shakespeare. This is a period in which questions about gender roles were being openly debated, and in which literary and otherwise discursive interrogations of social roles, particularly the role of women, pervaded genres but were most vivid on stage.",
        "term": null
    },
    {
        "name": "WGST 419 Renaissance Literature",
        "description": "A study of the literature of the English Early Modern period ranging from More to Milton and including the emerging literary voice of women writers. British literature covering the period 1500-1700, excluding drama.",
        "term": null
    },
    {
        "name": "WGST 432 CIS:",
        "description": "The Core Integration Seminar (CIS) engages the Year Four Question: “Imagining the possible: What is our role in the world?” by offering students a culminating seminar experience in which students integrate the principles of Jesuit education, prior components of the Core, and their disciplinary expertise. Each section of the course will focus on a problem or issue raised by the contemporary world that encourages integration, collaboration, and problem solving. The topic for each section of the course will be proposed and developed by each faculty member in a way that clearly connects to the Jesuit Mission, to multiple disciplinary perspectives, and to our students’ future role in the world.",
        "term": null
    },
    {
        "name": "WGST 434 Philosophy of Sex & Gender",
        "description": "Analyzes the concepts of sex, sexuality, and gender by working with authors across traditions and disciplines. We will be particularly concerned with the role of sex, sexuality, and gender may have on identity formation/subversion, questioning whether some or all of these concepts are essential/natural or socially constructed.",
        "term": null
    },
    {
        "name": "WGST 435 Feminist Ethics",
        "description": "Explores women's experiences of oppression and some of the ways in which this has marginalized their concerns and their perceptions of the moral dimension. Feminist contributions to re-thinking the concept of moral agency, the traditionally sharp distinction between the public and private domains, the relevance of personal relationships to ethics, and the process of moral development and moral decision-making are considered. Spring, odd years.",
        "term": "SO"
    },
    {
        "name": "WGST 460 Studies in Women Writers",
        "description": "This course provides an in-depth study of literary works written by women. May cover a variety of genres, time periods, and cultures or may be genre, period, or culture specific.",
        "term": null
    },
    {
        "name": "WGST 480 Special Topics",
        "description": "",
        "term": null
    },
    {
        "name": "WGST 490 Directed Reading",
        "description": "Supervised reading in one of the previously mentioned areas of study, not to replace existing courses but to provide an opportunity for advanced study not available within the regular curriculum. Directed reading requires completion of a form, WGST Department Chair permission, and cannot be registered for via Zagweb.",
        "term": null
    },
    {
        "name": "WGST 491 Directed Study-Women's Study",
        "description": "Specialized research into a topic of feminist scholarship. Directed study requires completion of a form, WGST Department Chair permission, and cannot be registered for via Zagweb.",
        "term": null,
        "prerequisites": {
            "type": "and",
            "requirements": [
                {
                    "type": "or",
                    "requirements": [
                        {
                            "course": "WGST 201 Minimum Grade: D"
                        },
                        {
                            "course": "WGST 202 Minimum Grade: D"
                        }
                    ]
                },
                {
                    "course": "WGST 401 Minimum Grade: D"
                }
            ]
        }
    },
    {
        "name": "WGST 497 Women & Gender Studies Intern",
        "description": "Opportunities to work as an intern with various agencies that assist women in Spokane. Students must take the initiative to contact an agency and a faculty supervisor. Students meet with a member of the Women, Gender, and Sexuality Studies faculty to discuss their experiences and write a paper integrating their internship experience with their WGST coursework. Fall and Spring.",
        "term": "FS"
    },
    {
        "name": "WGST 499 Capstone",
        "description": "The capstone course in the women's studies concentration provides an opportunity for a special kind of faculty and student conversation. Responsibility for organizing and structuring this course will rotate among women's studies faculty. Topics will vary. Regardless of the texts or topics, the goal will be to create a conversation in which students assume significant responsibilities. All students are expected to complete a major research project using the concepts and perspectives of feminist scholarship, and to present their work to the class and faculty evaluators. Spring only.",
        "term": "S",
        "prerequisites": {
            "type": "and",
            "requirements": [
                {
                    "course": "WGST 300 Minimum Grade: D"
                },
                {
                    "type": "or",
                    "requirements": [
                        {
                            "type": "or",
                            "requirements": [
                                {
                                    "type": "or",
                                    "requirements": [
                                        {
                                            "type": "or",
                                            "requirements": [
                                                {
                                                    "course": "WGST 401 Minimum Grade: D"
                                                },
                                                {
                                                    "course": "WGST 402 Minimum Grade: D"
                                                }
                                            ]
                                        },
                                        {
                                            "course": "POLS 341 Minimum Grade: D"
                                        }
                                    ]
                                },
                                {
                                    "course": "WGST 403 Minimum Grade: D"
                                }
                            ]
                        },
                        {
                            "course": "ENGL 480 Minimum Grade: D"
                        }
                    ]
                }
            ]
        }
    }
]